{"id":13542,"date":"2024-05-09T10:58:54","date_gmt":"2024-05-09T17:58:54","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=13542"},"modified":"2024-12-17T05:33:03","modified_gmt":"2024-12-17T13:33:03","slug":"what-is-diversification","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/","title":{"rendered":"How and Why to Diversify Your Portfolio"},"content":{"rendered":"\n<p>Diversification is the practice of buying a variety of different investments with the goal of balancing risk and reward in your portfolio. A well-diversified portfolio can help you maximize your expected returns without taking on unnecessary or unwanted risk. This is known as improving your “risk-adjusted returns.”<\/p>\n\n\n\n<p>You can think of diversification as a way to avoid putting all your eggs in one basket. While it’s tempting to try to outperform the market by picking a small handful of investments, <a href=\"https:\/\/www.cnbc.com\/2020\/09\/18\/stock-picking-has-a-terrible-track-record-and-its-getting-worse.html\">research shows<\/a> that even professional investors struggle to do this consistently. However, if you have a diversified portfolio, some of your investments may win and others may lose in different market conditions—and owning a broad range of investments can smooth out your returns in the long run. Plus, in volatile market conditions, you can take comfort in the fact that a diversified portfolio is often better insulated from dramatic losses.<\/p>\n\n\n\n<p>In this post, we’ll explain what diversification is and why it matters, as well as how to diversify your portfolio.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What makes a portfolio diversified?<\/h2>\n\n\n\n<p>Many investors think they have a well-diversified portfolio when, in reality, they don’t. In <em>The Elements of Investing<\/em>, Burton Malkiel (Wealthfront’s Chief Investment Officer) and Charley Ellis (noted investor, author, and member of our investment advisory board) outline the three dimensions of diversification you need to improve your chances of long-term investing success.&nbsp;<\/p>\n\n\n\n<p>The three ways you can (and should) diversify your portfolio are:&nbsp;<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Across assets<\/li>\n\n\n\n<li>Across asset classes<\/li>\n\n\n\n<li>Across time<\/li>\n<\/ol>\n\n\n\n<p>Let’s take a closer look at how to apply this to your portfolio.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How to diversify your portfolio<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">1. Diversify across assets<\/h3>\n\n\n\n<p>Diversifying across assets means investing in the stocks or bonds of many companies and issuers, not just a few. This is valuable because, as a rule of thumb, holding a large group of stocks is a well established way to reduce your exposure to potentially volatile price fluctuations of an individual stock, or even a handful of stocks.&nbsp;<\/p>\n\n\n\n<p>Doubling down on your company stock is a glaring example of <em>not<\/em> diversifying across assets. Even if you work for Apple, Google, or Meta, owning too much of your own company stock has the potential to create serious financial problems if you lose your job and your company’s stock loses value. In their book, Burton and Charley describe an Enron employee who invested her entire retirement savings in Enron stock through the company’s 401(k) plan, only to lose her job and see her savings decimated when Enron unraveled.<\/p>\n\n\n\n<p>This is an extreme example, but the general point is that individual stock ownership represents <a href=\"https:\/\/www.investopedia.com\/terms\/u\/unsystematicrisk.asp\">diversifiable risk<\/a> (in contrast to <a href=\"https:\/\/www.investopedia.com\/terms\/s\/systemic-risk.asp\">market or systemic risk<\/a>). Diversifiable risk, by definition, is risk specific to an individual company or industry that can be reduced by spreading your portfolio across a broad set of investments. To be diversified across assets, don’t invest your entire portfolio in a single stock, and don’t allow your company stock to dominate your portfolio after it has become vested and liquid.<\/p>\n\n\n\n<p>Instead of investing a large amount of money in a single stock, consider investing your money in a group of stocks or broadly diversified index funds. For example, if you wanted to get exposure to US equities, you could consider a low-cost ETF like the Vanguard Total Stock Market ETF (<a href=\"https:\/\/investor.vanguard.com\/etf\/profile\/VTI\">VTI<\/a>), which gives you exposure to almost 4,000 U.S. stocks (including Apple, Google, and Meta) for a low 0.03% annual expense ratio (which means you pay $3 annually for every $10,000 you invest).&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2. Diversify across asset classes<\/h3>\n\n\n\n<p>Another important way to diversify is across asset classes. Asset classes are groups of similar investments with shared characteristics. Because of these shared characteristics, their prices tend to move together in response to various events. You can improve your risk-adjusted returns by investing in multiple asset classes, because it is virtually impossible to predict which asset class is going to outperform the others in any given year. That’s why Wealthfront’s expert-built <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core\/classic\">Classic portfolios<\/a> contain at least five asset classes, and sometimes more depending on your individual risk tolerance.&nbsp;<\/p>\n\n\n\n<p>Anyone who tells you they can predict the performance of different asset classes with any reasonable consistency is either fooling themselves or trying to fool you. This is market timing, and you shouldn’t bother with it. Jack Bogle, the founder of the Vanguard Group, had a great saying about trying to time the market: “After nearly 50 years in this business, I do not know of anyone who has done it successfully and consistently. I don’t even know anybody who knows anybody who has done it successfully and consistently.”&nbsp;<\/p>\n\n\n\n<p>To illustrate this point, we put together the table below. It displays the ranking of asset class returns (represented by ETFs) by year for the past 10 years. We included all of the asset classes we consider in constructing <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core\/classic\">Wealthfront’s Classic portfolios<\/a>. The key takeaway is that no asset class consistently wins or loses.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1246\" height=\"970\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/07\/Screenshot-2024-05-09-at-10.43.12 AM.png\" alt=\"Chart displaying the ranking of asset class returns (represented by ETFs) by year for the past 10 years\" class=\"wp-image-17160\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/07\/Screenshot-2024-05-09-at-10.43.12 AM.png 1246w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/07\/Screenshot-2024-05-09-at-10.43.12 AM-640x498.png 640w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/07\/Screenshot-2024-05-09-at-10.43.12 AM-681x530.png 681w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/07\/Screenshot-2024-05-09-at-10.43.12 AM-768x598.png 768w\" sizes=\"auto, (max-width: 1246px) 100vw, 1246px\" \/><figcaption class=\"wp-element-caption\">Source: Wealthfront<\/figcaption><\/figure>\n\n\n\n<p>You might be surprised to learn that US stocks have only been the top-performing asset class for 3 out of the last 10 years. <strong>This is one reason we think it&#8217;s wise to have a globally diversified portfolio. <\/strong>When US stocks have an especially good year (as they did in the most recent full year for which we have data, 2023), people wonder why their diversified portfolio “underperformed” the US stock market. But there was no way to know ahead of time that US stocks would “win” relative to other asset classes. Even if you take the view that US stocks have had several good years lately (in our analysis, they were the top performing asset class for 3 out of the last 5 years) there’s no guarantee that that will continue to be the case. Consider, for example, the “lost decade” for US stocks in the 2000s, when the S&amp;P 500® finished the decade with negative returns. As the chart above shows, even in recent memory, US stocks haven’t consistently outperformed other asset classes. Hence, it’s wise to have other asset classes in your portfolio.<\/p>\n\n\n\n<p>From year to year, a given asset class can have very different performance. Look at natural resources, for example. It was the worst-performing asset class in 2014, 2015, 2017, 2018, 2020, and 2023. But it was the best-performing asset class in 2016, 2021, and 2022. This kind of variation (volatility) is exactly why it’s beneficial to own investments from a broad range of asset classes—when you hold a diverse set of asset classes that fit your investment goals and risk tolerance, you’re more likely to have high performers in your portfolio <em>and<\/em> less likely to be exposed to sharp losses when a given asset class has a bad year.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">3. Diversify across time<\/h3>\n\n\n\n<p>The final dimension of diversification is time. It’s better to invest as early in your career as you can to give your returns more time to <a href=\"https:\/\/www.wealthfront.com\/blog\/what-is-compounding\/\">compound<\/a>. There is nothing as magical in investing as generating returns on top of prior returns and repeating this over and over again. Albert Einstein reportedly said: “Compound interest is the eighth wonder of the world.” Of course, to take full advantage of compounding, you also need to stay invested through market ups and downs.&nbsp;<\/p>\n\n\n\n<p>In an ideal world, you would invest a large amount of money as early as possible and leave it in the market for a very long time. Unfortunately, this isn’t consistent with how most people earn (i.e. most people tend to earn a salary over time instead of having a lot of investable assets when they get started) and it might be necessary to work through some decisions (like buying a home or paying off student loans) before investing a large sum anyway. Plus, investing all at once can make you sensitive to the timing of your investments—you might worry about picking the “wrong day.”&nbsp;<\/p>\n\n\n\n<p>Because of this, too many investors suffer from decision paralysis: They are so afraid of picking the “wrong day” to invest, they end up not investing their savings at all. As a result, they miss out on valuable time in the market when their savings could have been growing and compounding.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/www.wealthfront.com/blog\/dollar-cost-averaging-behavioral-view\/\">Dollar-cost averaging<\/a> is a popular way to diversify across time and avoid this issue. Rather than picking the “right day” to invest, dollar-cost averaging is a process where investors break up a lump sum into several smaller amounts, and then invest a portion consistently on a set schedule. For example, an investor with a $20,000 bonus might invest $4,000 per month for five months instead of putting it all in the market on the same day.&nbsp;<\/p>\n\n\n\n<p>Wealthfront’s automation features make it easy to diversify across time: You can set up recurring deposits and our software will automatically handle the trades for you. You can invest a specific amount every pay cycle, for example, or use recurring deposits to dollar-cost average a large sum of money into the market. We’ll also rebalance your investments automatically so your portfolio stays well diversified for your risk tolerance and goals over time.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Diversify your investments to build long-term wealth<\/h2>\n\n\n\n<p>If you diversify across all three dimensions recommended in this post, you’re in a better position to increase your risk-adjusted returns over the long run—and investing in a properly diversified portfolio doesn’t have to be a lot of work. You can invest in Wealthfront’s expert-built <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core\/classic\">Classic<\/a>, <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/sri\/socially-responsible\">Socially Responsible<\/a>, and <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core-di\/direct-indexing\">Direct Indexing<\/a> portfolios with just a few clicks. Having a well-diversified portfolio also lets you benefit from rebalancing and <a href=\"https:\/\/www.wealthfront.com\/tax-loss-harvesting\">tax-loss harvesting<\/a>. Wealthfront offers both of these services to clients at no additional cost.&nbsp;<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Diversification is the practice of buying a variety of different investments with the goal of balancing risk and reward in your portfolio. A well-diversified portfolio can help you maximize your expected returns without taking on unnecessary or unwanted risk. This is known as improving your “risk-adjusted returns.” You can think of diversification as a way [&hellip;]<\/p>\n","protected":false},"author":129,"featured_media":13595,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1282],"tags":[1302,1629,1281,1994],"coauthors":[2433,1270],"class_list":["post-13542","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","tag-diversification","tag-dollar-cost-averaging","tag-investing","tag-three-dimensions-of-diversification"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diversification: What Is It and Why Does It Matter?│Wealthfront<\/title>\n<meta name=\"description\" content=\"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Diversification: What Is It and Why Does It Matter?│Wealthfront\" \/>\n<meta property=\"og:description\" content=\"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2024-05-09T17:58:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-12-17T13:33:03+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1472\" \/>\n\t<meta property=\"og:image:height\" content=\"530\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Fang Rui, CFA, Alex Michalka, Ph.D\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Fang Rui, CFA, Alex Michalka, Ph.D\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/\",\"name\":\"Diversification: What Is It and Why Does It Matter?│Wealthfront\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png\",\"datePublished\":\"2024-05-09T17:58:54+00:00\",\"dateModified\":\"2024-12-17T13:33:03+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77\"},\"description\":\"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png\",\"width\":1410,\"height\":528},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How and Why to Diversify Your Portfolio\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77\",\"name\":\"The Wealthfront Team\",\"description\":\"The Wealthfront Team believes everyone deserves access to sophisticated financial advice. The team includes Certified Financial Planners (CFPs), Chartered Financial Analysts (CFAs), a Certified Public Accountant (CPA), and individuals with Series 7 and Series 66 registrations from FINRA. Collectively, the Wealthfront Team has decades of experience helping people build secure and rewarding financial lives.\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/teamwealthfront\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diversification: What Is It and Why Does It Matter?│Wealthfront","description":"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/","og_locale":"en_US","og_type":"article","og_title":"Diversification: What Is It and Why Does It Matter?│Wealthfront","og_description":"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.","og_url":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/","og_site_name":"Wealthfront Blog","article_published_time":"2024-05-09T17:58:54+00:00","article_modified_time":"2024-12-17T13:33:03+00:00","og_image":[{"width":1472,"height":530,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner.png","type":"image\/png"}],"author":"Fang Rui, CFA, Alex Michalka, Ph.D","twitter_card":"summary_large_image","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Fang Rui, CFA, Alex Michalka, Ph.D","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/","url":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/","name":"Diversification: What Is It and Why Does It Matter?│Wealthfront","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png","datePublished":"2024-05-09T17:58:54+00:00","dateModified":"2024-12-17T13:33:03+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77"},"description":"Diversification is one of the keys to investing success. In this post, we break down exactly what you need to know.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/what-is-diversification\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2020\/10\/SP-500-banner-1.png","width":1410,"height":528},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/what-is-diversification\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"How and Why to Diversify Your Portfolio"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77","name":"The Wealthfront Team","description":"The Wealthfront Team believes everyone deserves access to sophisticated financial advice. The team includes Certified Financial Planners (CFPs), Chartered Financial Analysts (CFAs), a Certified Public Accountant (CPA), and individuals with Series 7 and Series 66 registrations from FINRA. Collectively, the Wealthfront Team has decades of experience helping people build secure and rewarding financial lives.","url":"https:\/\/www.wealthfront.com/blog\/author\/teamwealthfront\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13542","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/129"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=13542"}],"version-history":[{"count":10,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13542\/revisions"}],"predecessor-version":[{"id":17515,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13542\/revisions\/17515"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/13595"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=13542"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=13542"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=13542"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=13542"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}