{"id":13817,"date":"2023-10-09T16:33:06","date_gmt":"2023-10-09T23:33:06","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=13817"},"modified":"2024-09-24T12:05:13","modified_gmt":"2024-09-24T19:05:13","slug":"short-term-long-term-savings","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/","title":{"rendered":"How Should I Save for Short-Term vs. Long-Term Goals?"},"content":{"rendered":"\n<p>When you think about your financial future, you probably have three kinds of goals: short-term goals, like a vacation you plan to take later this year, near-term goals, like a down payment for a house, and long-term goals, like sending a child to college or retiring. In order to give yourself the best chance of comfortably reaching those goals, you should approach your short-term, near-term, and long-term savings differently. Here’s exactly what you need to know.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The 1–3 and 3–5 year rule<\/strong><\/h2>\n\n\n\n<p>First, let’s talk about the difference between the three types of goals. As a rule of thumb, we define a short-term goal as anything in the next year, a near-term goal as something in the next one to three years, and a long-term goal is anything more than three to five years away. If your goal is in the middle of that range, say four years, you should take into account how flexible your timing is.&nbsp;<\/p>\n\n\n\n<p>For example, if you know you will definitely want to buy a new home in four years and you have no flexibility on the timing, you may want to treat that as a near-term goal. But if you are pretty flexible and would be OK waiting another year or so if you needed to, it’s probably fine to treat buying that home as a long-term goal.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Save for short-term goals in a high-yield cash account<\/h2>\n\n\n\n<div class=\"o-grid__col-medium--12 o-grid__col--3 c-post__related c-post__box right\"><div class=\"c-post__box-content\">Earn an industry-leading APY on your short-term cash. <a href=\"https:\/\/www.wealthfront.com\/start\/account-type\/for?highLevel=banking&amp;intent=cash&amp;utm_source=blog&amp;utm_medium=pcallout&amp;utm_campaign=shortvslongterm\">Open a Cash Account<\/a><\/div><\/div>\n\n\n\n<p>If you have a short-term goal, within the next year, it’s important to make sure the money you’ll need is available when you’re ready to invest or spend it. That’s why you should save for short-term goals in a high-yield cash account. By using a high-yield cash account (like the <a href=\"https:\/\/www.wealthfront.com\/cash\">Wealthfront Cash Account<\/a>) you can avoid taking market risk with your short-term cash and also earn many times the interest you’d otherwise earn at a traditional bank. You should choose an account that doesn’t charge fees, as <a href=\"https:\/\/www.wealthfront.com\/blog\/what-you-should-know-about-bank-fees\/\">fees will erode your wealth over time<\/a>. You’ll also want to pick an account where your savings will be <a href=\"https:\/\/www.wealthfront.com\/blog\/the-difference-between-fdic-and-sipc-insurance\/\">FDIC insured<\/a>.<\/p>\n\n\n\n<p>Avoid the temptation to invest your short-term savings. Financial markets are unpredictable in the short term, and it would be unfortunate to need cash at the exact moment your investment portfolio temporarily declined in value. This is the same reason that it typically makes sense to keep your <a href=\"https:\/\/www.wealthfront.com\/blog\/build-emergency-fund\/\">emergency fund<\/a> in a high-yield cash account instead of in the market.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Invest for near-term goals in a diversified portfolio of bonds or bond ETFs<\/h2>\n\n\n\n<p>If you’re planning for a big expense one to three years from now, we consider that a near-term goal. To save for your near-term goals, you have a few different options. One is to hold your savings in your high yield savings or cash account for a longer period of time. If you’re in the market to buy a home and waiting for the perfect opportunity to come along, you might prefer to hold those savings in cash so that you can jump at the opportunity sooner than you expect. If you’re open to taking on some risk and you know the opportunity is going to be at least a year from now, a good optimization option for your savings is to invest in a fixed income product like Bonds or a certificate of deposit (CD). Bonds and CDs are lower risk than equities but have a higher potential earning than saving your money in cash.&nbsp;<\/p>\n\n\n\n<p>It can be tempting to put all of your extra cash in just one or two bonds but like investing in equities, the best way to mitigate risk is to diversify across multiple bonds or bond ETFs.<\/p>\n\n\n\n<p>There are many ways to invest in bonds: investors can purchase a bond directly through a brokerage firm or TreasuryDirect, or by investing in bond ETFs or mutual funds. Unfortunately, buying bonds directly can come with challenges: high minimums, lack of diversification, and liquidity restrictions. CDs come with similar liquidity challenges including set maturity dates and early withdrawal penalties. They also lock you in at a set rate that does not increase as interest rates rise leaving you at risk for earning less over the entire lockup period.<\/p>\n\n\n\n<p>Bond ETFs avoid all of these obstacles because like a stock ETF, these are traded on stock exchanges throughout the trading day and hold a basket of bonds allowing it to remain liquid. This means the money is available to you regardless of a single bond’s maturity date and they are naturally more diversified than an individual bond.<\/p>\n\n\n\n<p>Our <a href=\"https:\/\/www.wealthfront.com\/blog\/introducing-automated-bond-portfolio\/\">Automated Bond Portfolio<\/a> is made of a diversified mix of bond ETFs to provide a higher yield than Treasury bills, CDs, and high-yield savings accounts. They provide more liquidity than I bonds and CDs, less risk than equities and corporate bonds, and are tax optimized for&nbsp; your personal situation. This combination makes it a great place to grow the savings that you need soon but not urgently (those you hold in cash).<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Save for long-term goals in an investment account<\/h2>\n\n\n\n<div class=\"o-grid__col-medium--12 o-grid__col--3 c-post__related c-post__box right\"><div class=\"c-post__box-content\">Wealthfront automates investing best practices to help you build long-term wealth. <a href=\"https:\/\/www.wealthfront.com\/start\/account-type\/goal?intent=investing&amp;utm_source=blog&amp;utm_medium=pcallout&amp;utm_campaign=shortvslongterm\">Open an Automated Investing Account<\/a><\/div><\/div>\n\n\n\n<p>If you’re saving for a purchase you won’t make within the next three to five years, that’s a long-term goal. To save for your long-term goals, a good option is to invest in equities. Many people are tempted to hold their long-term savings in cash, but the <a href=\"https:\/\/www.wealthfront.com\/blog\/your-high-yield-cash-account-shouldnt-be-your-only-savings-vehicle\/\">problem with saving for long-term goals in a savings or cash account<\/a> (even a high-yield one) or <a href=\"https:\/\/www.wealthfront.com\/blog\/invest-when-rates-rise\/\">even in bonds<\/a> is that the rate of earning on these accounts has seldom kept up with <a href=\"https:\/\/www.wealthfront.com\/blog\/the-right-and-wrong-ways-to-protect-yourself-from-inflation\/\">inflation<\/a> over the last decade. This means over time your savings can actually lose buying power. Investing in equities can help you avoid this problem by allowing you to earn a higher rate of return over the long term with a little added risk.<\/p>\n\n\n\n<p>There are a lot of different ways you can invest your money, but we suggest that you invest in a <a href=\"https:\/\/www.wealthfront.com\/blog\/what-is-diversification\/\">diversified<\/a> portfolio of low-cost index funds instead of investing your life’s savings in individual stocks (which is riskier and more likely to end in you losing money). You don’t have to take our word for it: <a href=\"https:\/\/www.math.hkust.edu.hk\/~maykwok\/courses\/ma362\/07F\/markowitz_JF.pdf\">academic research<\/a> has consistently found that diversifying your portfolio across asset classes is the best way to maximize returns across every level of risk.&nbsp;<\/p>\n\n\n\n<p>When choosing an investment account, there are two main types to consider: tax-advantaged (meaning they come with tax breaks) and taxable. 529 accounts and IRAs are examples of tax-advantaged accounts you can use to save for specific goals like sending a child to college or retirement, respectively. However, it’s important to understand that these accounts come with withdrawal restrictions and penalties if you don’t use them according to the rules governing each specific account type. Taxable accounts, on the other hand, are highly flexible. You can use them for whatever you want, and you won’t pay a withdrawal penalty for taking your money out. Plus, if you use a taxable account, you can conduct <a href=\"https:\/\/www.wealthfront.com\/blog\/tax-loss-harvesting-101\/\">tax-loss harvesting<\/a>—a strategy that takes advantage of market volatility to lower your tax bill. How much can this help? In 2022, <a href=\"https:\/\/www.wealthfront.com\/blog\/tax-loss-harvesting-2022-results\/\">Wealthfront’s automated Tax-Loss Harvesting service<\/a> generated average estimated tax savings worth 15x our annual 0.25% advisory fee for clients who started using the service in a <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core\/classic\">Classic<\/a> or <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/sri\/socially-responsible\">Socially Responsible<\/a> portfolio last year.&nbsp;<\/p>\n\n\n\n<p>In short, using a taxable investment account to save for a long-term goal means your savings have a better chance of increasing in buying power and growing significantly—and you’ll also have plenty of flexibility. Typically, the <a href=\"https:\/\/www.wealthfront.com\/blog\/think-long-term-investing\/\">longer you stay invested<\/a>, the better the odds that you’ll earn returns.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Key takeaways&nbsp;<\/h2>\n\n\n\n<p>There’s an easy way to think about saving for your goals: risk and return are correlated. The higher the risk, the higher the expected return. This means in situations where you can’t afford to take any market risk (like when you’re saving for a short-term goal), you’ll sacrifice higher returns. But when you have a longer time horizon, your willingness to take on market risk can result in higher returns down the road—especially once you factor in the impact of <a href=\"https:\/\/www.wealthfront.com\/blog\/what-is-compounding\/\">compounding<\/a>.&nbsp;<\/p>\n\n\n\n<p>Here’s what you need to remember:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Keep your short-term savings in a high-yield savings account with low fees, FDIC insurance, and a high APY. That way, your money will grow a little and be there when you need it.<\/li>\n\n\n\n<li>Keep your near-term savings in a higher-yield, low-risk diversified bond portfolio. That way, your money will grow at a 1-3% higher rate than a high yield cash account with only a minor increase in risk helping you achieve your goals.&nbsp;<\/li>\n\n\n\n<li>Keep your long-term savings in a low-fee, diversified investment account. That way, your money will have a better shot at keeping up with inflation and increasing your buying power.<\/li>\n<\/ul>\n\n\n\n<p>No matter what kind of goal you’re saving for, Wealthfront offers the accounts you need to meet them with confidence. For your short-term savings, like your emergency fund or what you’re intending to invest in the future, you’re intending to invest, our <a href=\"https:\/\/www.wealthfront.com\/cash\">Cash Account<\/a> comes with a 4.00% APY through partner banks, no account fees, and up to $8 million of FDIC insurance through our partner banks (which is 32 what you’d get from a traditional bank). For your near-term savings, we offer our <a href=\"https:\/\/www.wealthfront.com\/automated-bond-portfolio\">Automated Bond Portfolio<\/a>, a diversified portfolio of Bond ETFs that we build and optimize to your personal tax situation. For your long-term savings, we offer taxable and tax-advantaged <a href=\"https:\/\/www.wealthfront.com\/investing\">Automated Investing Accounts<\/a> with diversified portfolios of low cost index funds, personalized to your risk tolerance and goals. The Automated Bond Portfolio and Automated Investing Accounts come with a full suite of our award-winning automation features designed to maximize your after-tax returns and make investing effortless.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you think about your financial future, you probably have three kinds of goals: short-term goals, like a vacation you plan to take later this year, near-term goals, like a down payment for a house, and long-term goals, like sending a child to college or retiring. In order to give yourself the best chance of [&hellip;]<\/p>\n","protected":false},"author":129,"featured_media":15899,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1282,2390],"tags":[2418,1462],"coauthors":[2508],"class_list":["post-13817","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing","category-saving","tag-long-term-goals","tag-long-term-investing"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Save for Short-Term Goals vs. Long-Term Goals<\/title>\n<meta name=\"description\" content=\"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Save for Short-Term Goals vs. Long-Term Goals\" \/>\n<meta property=\"og:description\" content=\"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2023-10-09T23:33:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-09-24T19:05:13+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"961\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Joanna Lawson\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Joanna Lawson\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/\",\"name\":\"How To Save for Short-Term Goals vs. Long-Term Goals\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg\",\"datePublished\":\"2023-10-09T23:33:06+00:00\",\"dateModified\":\"2024-09-24T19:05:13+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77\"},\"description\":\"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg\",\"width\":2560,\"height\":961,\"caption\":\"Photo by Surja Sen Das Raj on Unsplash\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Should I Save for Short-Term vs. Long-Term Goals?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77\",\"name\":\"The Wealthfront Team\",\"description\":\"The Wealthfront Team believes everyone deserves access to sophisticated financial advice. The team includes Certified Financial Planners (CFPs), Chartered Financial Analysts (CFAs), a Certified Public Accountant (CPA), and individuals with Series 7 and Series 66 registrations from FINRA. Collectively, the Wealthfront Team has decades of experience helping people build secure and rewarding financial lives.\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/teamwealthfront\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Save for Short-Term Goals vs. Long-Term Goals","description":"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/","og_locale":"en_US","og_type":"article","og_title":"How To Save for Short-Term Goals vs. Long-Term Goals","og_description":"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.","og_url":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/","og_site_name":"Wealthfront Blog","article_published_time":"2023-10-09T23:33:06+00:00","article_modified_time":"2024-09-24T19:05:13+00:00","og_image":[{"width":2560,"height":961,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg","type":"image\/jpeg"}],"author":"Joanna Lawson","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Joanna Lawson","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/","url":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/","name":"How To Save for Short-Term Goals vs. Long-Term Goals","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg","datePublished":"2023-10-09T23:33:06+00:00","dateModified":"2024-09-24T19:05:13+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77"},"description":"You need separate strategies for your long-term, near-term, and short-term savings. Here’s what you need to know to pick the right approach for your goals.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/08\/surja-sen-das-raj-MoUjO2X8KQE-unsplash-scaled.jpg","width":2560,"height":961,"caption":"Photo by Surja Sen Das Raj on Unsplash"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/short-term-long-term-savings\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"How Should I Save for Short-Term vs. Long-Term Goals?"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/3eca21c0f00c276ebcaa3d634995cb77","name":"The Wealthfront Team","description":"The Wealthfront Team believes everyone deserves access to sophisticated financial advice. The team includes Certified Financial Planners (CFPs), Chartered Financial Analysts (CFAs), a Certified Public Accountant (CPA), and individuals with Series 7 and Series 66 registrations from FINRA. Collectively, the Wealthfront Team has decades of experience helping people build secure and rewarding financial lives.","url":"https:\/\/www.wealthfront.com/blog\/author\/teamwealthfront\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13817","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/129"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=13817"}],"version-history":[{"count":21,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13817\/revisions"}],"predecessor-version":[{"id":17402,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/13817\/revisions\/17402"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/15899"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=13817"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=13817"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=13817"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=13817"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}