{"id":15994,"date":"2022-10-31T15:41:04","date_gmt":"2022-10-31T22:41:04","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=15994"},"modified":"2024-09-16T09:55:11","modified_gmt":"2024-09-16T16:55:11","slug":"wealthfront-isnt-a-bank","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/","title":{"rendered":"Wealthfront Isn’t a Bank — Here’s Why That’s a Good Thing"},"content":{"rendered":"\n<p>It’s no secret: Wealthfront is not a bank. We’re proud of this because it’s a huge benefit to our clients. Choosing not to be a bank is what enables us to offer you best-in-class products like the <a href=\"https:\/\/www.wealthfront.com\/cash\">Cash Account<\/a> that are far superior to what a bank can offer, so you can grow your long-term wealth easily and conveniently. In this post, we’ll explain how Wealthfront’s non-bank status allows us to deliver value to clients in a way that banks often can’t or won’t.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We don’t have retail branches<\/h2>\n\n\n\n<p>Bank branches are a big part of the traditional bank’s business model. Historically, branches have been a place to do things like talk to your banker, send wires, deposit money, and take out loans. Branches served a purpose in the age before smartphones, but they were and still are expensive to staff and maintain.<\/p>\n\n\n\n<p>According to one <a href=\"https:\/\/thefinancialbrand.com\/news\/banking-branch-transformation\/bank-branch-roi-deposits-profitability-74386\/\">estimate<\/a>, a single bank branch can cost between $600,000 and $800,000 to run annually, including back office costs. As a result, each branch needs to generate between $600,000 and $800,000 annually just to break even, let alone turn a profit. They do this in multiple ways, including charging account fees and declining to pay you much (if any) interest on your deposits. Bank of America, for example, has about <a href=\"https:\/\/newsroom.bankofamerica.com\/companyoverview#:~:text=The%20company%20provides%20unmatched%20convenience,56%20million%20verified%20digital%20users.\">68 million<\/a> retail clients (including small businesses) and 3,900 retail branches, which works out to 17,436 customers per branch. That means each Bank of America branch needs to get between $34 and $46 from you on average each year just to break even. Keep in mind the average cost per client could be much higher at a bank with branches that serve fewer people.<\/p>\n\n\n\n<p>Today, it&#8217;s possible to do all of your banking remotely without the hassle of visiting an actual bank in person. That&#8217;s why Wealthfront doesn&#8217;t have retail branches — and because we only build things we can automate, our back office costs are quite small. We don&#8217;t have an antiquated network of expensive retail branches costing us $600,000 to $800,000 each year, so we don&#8217;t need to get that $34 to $46 (or more!) from you.<\/p>\n\n\n\n<p>As a result, we can do two things that help your savings grow faster. One, we can <a href=\"https:\/\/www.wealthfront.com\/blog\/why-is-wealthfront-cash-account-apy-so-high\/\">pay you a lot more interest on your deposits<\/a> instead of keeping it all for ourselves and our branches. And two, we can avoid charging you any <a href=\"https:\/\/www.wealthfront.com\/blog\/bank-fees-and-how-to-avoid-them\/\">account fees<\/a> like overdraft fees, transfer fees, and monthly maintenance fees. This means your money grows much faster at Wealthfront than it would in a bank account, and it is protected from account fees that eat away at your wealth.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We’re not regulated like a bank<\/h2>\n\n\n\n<p>It probably won’t surprise you to learn that banks are highly regulated. Many of these regulations are intended to keep your money safe, which is a good thing. But unfortunately, some bank regulations can have negative side effects. This is because bank regulators are charged with protecting the overall stability of the financial system, not ensuring customer satisfaction. As a result, regulators are very much focused on the profitability of banks and the predictability of their business. This impacts customers in two ways. One, banks can face pressure from regulators to pay less interest on deposits so they can earn higher profits.&nbsp; And two, banks are also constrained in their ability to build new products, because experimentation with new products represents risk in the eyes of regulators.<\/p>\n\n\n\n<p>Let’s look at an example of a specific bank regulation to illustrate how they can work against customers. You may have noticed that some savings accounts only allow six transfers per month before charging a fee. This seemingly arbitrary limit is included in provisions of <a href=\"https:\/\/www.investopedia.com\/this-government-regulation-restricts-how-often-you-can-move-money-out-of-your-savings-account-4589978\">Regulation D<\/a>. Until they were temporarily suspended in early 2020, these provisions limited you to six transfers from a savings account each month. As a result, you had to have both a savings and a checking account if you wanted to earn the higher interest typically associated with a savings account and also have a checking account for daily transactions. Despite the fact that the rule hasn’t been active for over two years, some banks continue to charge “excess activity” fees for exceeding six transfers. As of the time of publication, Regulation D’s transaction limits remain suspended but the change has <a href=\"https:\/\/www.bankrate.com\/banking\/savings-account-withdrawal-limits-top-banks-who-lifted-them\/#:~:text=Most%20Savings%20Accounts%20Still%20Come,Regulation%20D%20Lifted%20Them%20%7C%20Bankrate\">still not been made final<\/a> which means it could come back. But because Wealthfront is not a bank, we’ve been able to offer our Cash Account with unlimited transfers from the start. Wealthfront brokers client deposits to “demand” accounts at partner banks (more on that below) which, like checking accounts, don’t have transaction limits. That way client transfers aren’t limited like they would be in savings accounts under Regulation D.<\/p>\n\n\n\n<p>This is just one example, but issues like these are exactly why Wealthfront hasn’t taken steps to become a bank — many of the constraints on banks run counter to putting the interests of our clients first. We want to keep building innovative products like our Cash Account, which offers best-in-class automation features so you can organize your savings into categories, track your progress against your goals, and invest your money within minutes during market hours. And we don’t want to commit to a business plan that puts pressure on us to profit from clients; we want to pay you a lot of interest (and we do — our current APY of 4.00% is many times the national average offered by savings accounts).&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We broker our deposits to partner banks<\/h2>\n\n\n\n<p>A final key difference between Wealthfront and banks is we broker our deposits to partner banks instead of holding them ourselves. (Banks generally prefer not to do this, as it’s often more profitable for them to hold client deposits directly.) The fact that Wealthfront brokers its deposits has two key benefits for you.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">1. You get more FDIC insurance<\/h3>\n\n\n\n<p>When you deposit your money at a bank, it’s covered by what’s known as <a href=\"https:\/\/www.wealthfront.com\/blog\/the-difference-between-fdic-and-sipc-insurance\/\">FDIC insurance<\/a>. FDIC stands for Federal Deposit Insurance Corporation, and it was founded in 1933 as an independent agency of the U.S. government to protect cash held in bank accounts.&nbsp;<\/p>\n\n\n\n<p>FDIC insurance covers up to $250,000 per depositor, per-FDIC insured bank, per account category. But with a Wealthfront Cash Account, your money might be deposited at up to 32 of our partner banks at any given time, which means you actually get 32x the regular amount of FDIC insurance, or up to $8 million for your Cash Account instead of the $250,000 you’d get in a single account at a regular bank. If you have a joint Cash Account, you get up to $16 million in FDIC insurance. <\/p>\n\n\n\n<p>Sometimes people ask us how their funds are protected when they’re in transit to one of Wealthfront’s partner banks. In most cases, this doesn’t come up because we sweep your cash to our partner banks on the same day we receive it. But in the less likely event your money takes a day or two to arrive, your funds are still protected. That’s because our Cash Account is offered by Wealthfront Brokerage, a federally registered broker-dealer and therefore includes Securities Investor Protection Corporation or <a href=\"https:\/\/www.wealthfront.com\/blog\/the-difference-between-fdic-and-sipc-insurance\/\">SIPC insurance<\/a>, which covers up to $250,000 of your cash while it’s in transit to a partner bank.<\/p>\n\n\n\n<p>With all of this insurance, your money is arguably much safer in a Wealthfront Cash Account than it would be at a bank.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2. You benefit from wholesale rates<\/h3>\n\n\n\n<p>The second benefit of brokering our deposits is that Wealthfront can take advantage of wholesale interest rates, which means you earn more interest. Banks are required by regulators to maintain a defined percentage of loan value in deposits. When loan demand spikes, banks typically need more deposits to meet that demand. To attract those deposits, banks often need to offer a higher interest rate, at least for a short period of time. However, it’s difficult to temporarily offer higher rates to consumers because they will be disappointed by the rate decrease once the bank has attracted the necessary deposits. To avoid this problem, banks offer higher interest rates on the wholesale market to broker-dealers like Wealthfront. The benefit of offering a higher rate on the wholesale market is a bank’s consumer depositors never see that their bank offered a higher rate. Wealthfront takes advantage of these higher wholesale rates to offer our clients a higher APY on the Wealthfront Cash Account.&nbsp;<\/p>\n\n\n\n<p>We navigate relationships with our partner banks so our clients can benefit from high wholesale rates whenever possible. We work tirelessly to ensure we’re getting the best rates we can for your cash. We can then pass even more interest along to you so your cash works harder for you with no extra effort.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront is better than a bank<\/h2>\n\n\n\n<p>At Wealthfront, we’re building a <a href=\"https:\/\/www.wealthfront.com\/blog\/wealthfronts-new-mission\/\">financial system that favors people, not institutions<\/a>. The fact that we aren’t a bank (i.e. don’t have a bank charter and as a result are not regulated by bank regulators) is a big part of how we’re able to deliver on that mission, and it’s how we built a <a href=\"https:\/\/www.wealthfront.com\/cash\">Cash Account<\/a> that offers all the banking features you need without the hassle and cost of an actual bank account.&nbsp;<\/p>\n\n\n\n<p>Whether you’re saving up for an <a href=\"https:\/\/www.wealthfront.com\/blog\/build-emergency-fund\/\">emergency fund<\/a>, building a down payment, or just keeping money handy for short-term goals and expenses, the Wealthfront Cash Account is an ideal home for your cash. With a <a href=\"https:\/\/www.wealthfront.com\/blog\/cash-account-apy\">high APY<\/a> that’s designed to earn you more, up to $8 million in FDIC insurance, and no account fees, your money works harder in a Cash Account. The Cash Account also has best-in-class automation features so you can sort your savings into categories, measure progress against your financial goals, and invest your money within minutes during market hours when you’re ready to build long-term wealth. And since you get access to a debit card and 19,000 free ATMs, your cash is always available on your terms. <strong>In short, the Wealthfront Cash Account isn’t a bank account — it’s something much, much better. <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s no secret: Wealthfront is not a bank. We’re proud of this because it’s a huge benefit to our clients. Choosing not to be a bank is what enables us to offer you best-in-class products like the Cash Account that are far superior to what a bank can offer, so you can grow your long-term [&hellip;]<\/p>\n","protected":false},"author":149,"featured_media":15996,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[2390],"tags":[],"coauthors":[1216],"class_list":["post-15994","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-saving"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront<\/title>\n<meta name=\"description\" content=\"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront\" \/>\n<meta property=\"og:description\" content=\"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-31T22:41:04+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-09-16T16:55:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"962\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Amber Guerrero\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Amber Guerrero\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/\",\"name\":\"Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg\",\"datePublished\":\"2022-10-31T22:41:04+00:00\",\"dateModified\":\"2024-09-16T16:55:11+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/535c62f805973864db2968a3b410a6d5\"},\"description\":\"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg\",\"width\":2560,\"height\":962,\"caption\":\"Photo by Robert Bye, Unsplash\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Wealthfront Isn’t a Bank — Here’s Why That’s a Good Thing\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/535c62f805973864db2968a3b410a6d5\",\"name\":\"Amber Guerrero\",\"description\":\"Amber is a Senior Manager of Product Support at Wealthfront and a licensed financial advisor holding Series 24, Series 65, Series 63, and Series 7 licenses from FINRA. Prior to joining Wealthfront, she worked at Scottrade.\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/amberg\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront","description":"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/","og_locale":"en_US","og_type":"article","og_title":"Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront","og_description":"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.","og_url":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/","og_site_name":"Wealthfront Blog","article_published_time":"2022-10-31T22:41:04+00:00","article_modified_time":"2024-09-16T16:55:11+00:00","og_image":[{"width":2560,"height":962,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg","type":"image\/jpeg"}],"author":"Amber Guerrero","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Amber Guerrero","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/","url":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/","name":"Wealthfront Isn’t a Bank — That’s Good News for You | Wealthfront","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg","datePublished":"2022-10-31T22:41:04+00:00","dateModified":"2024-09-16T16:55:11+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/535c62f805973864db2968a3b410a6d5"},"description":"Wealthfront isn’t a bank, and that’s good news for you and your deposits. Read on for the details.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2022\/10\/robert-bye-jeF-vyxytb4-unsplash-scaled.jpg","width":2560,"height":962,"caption":"Photo by Robert Bye, Unsplash"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/wealthfront-isnt-a-bank\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"Wealthfront Isn’t a Bank — Here’s Why That’s a Good Thing"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/535c62f805973864db2968a3b410a6d5","name":"Amber Guerrero","description":"Amber is a Senior Manager of Product Support at Wealthfront and a licensed financial advisor holding Series 24, Series 65, Series 63, and Series 7 licenses from FINRA. Prior to joining Wealthfront, she worked at Scottrade.","url":"https:\/\/www.wealthfront.com/blog\/author\/amberg\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/15994","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/149"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=15994"}],"version-history":[{"count":20,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/15994\/revisions"}],"predecessor-version":[{"id":17375,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/15994\/revisions\/17375"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/15996"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=15994"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=15994"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=15994"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=15994"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}