{"id":16148,"date":"2023-01-05T14:01:48","date_gmt":"2023-01-05T22:01:48","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=16148"},"modified":"2023-10-10T14:47:48","modified_gmt":"2023-10-10T21:47:48","slug":"how-wealthfront-keeps-your-savings-safe","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/","title":{"rendered":"How Wealthfront Keeps Your Savings Safe"},"content":{"rendered":"\n<p>When you’re building your savings and managing your finances, it’s important to keep your money somewhere safe. <strong>Wealthfront is an exceptionally safe place to keep your savings <strong>—<\/strong> arguably much safer than other financial institutions.<\/strong> We know many of our clients are eager to understand the details, and we’re proud to share them.<\/p>\n\n\n\n<p>At Wealthfront, we protect your funds in a variety of ways, like offering <a href=\"https:\/\/www.wealthfront.com\/blog\/the-difference-between-fdic-and-sipc-insurance\/\">two kinds of insurance<\/a> (including <a href=\"https:\/\/www.wealthfront.com\/blog\/cash-account-2m-fdic-insurance\/\">32x the FDIC insurance a bank can offer<\/a> through our partner banks), complying with the guidelines set by two federal regulators charged with protecting consumers, and diligently upholding very robust <a href=\"https:\/\/www.wealthfront.com\/blog\/thoughts-security\/\">security practices<\/a>. Here’s exactly what you need to know.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront offers two kinds of insurance<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">Our Cash Account has up to $8 million in FDIC insurance through our partner banks<\/h3>\n\n\n\n<p>FDIC insurance should be a primary consideration when you evaluate how safe your short-term savings will be at a given institution. FDIC insurance is provided by the Federal Deposit Insurance Corporation, and it generally covers up to $250,000 per depositor per account type at a bank. In other words, regular bank accounts typically have up to $250,000 of FDIC insurance. This insurance kicks in <a href=\"https:\/\/www.magnifymoney.com\/banking\/deposits-bank-failures\/#:~:text=to%20have%20failed.-,How%20often%20do%20banks%20fail%3F,one%20fewer%20than%20in%202019.\">if your bank fails<\/a> and loses your money, which is rare but not unheard of. $250,000 of FDIC insurance is standard, but more is even better.<\/p>\n\n\n\n<p>At Wealthfront, we’re able to offer up to <a href=\"https:\/\/www.wealthfront.com\/blog\/cash-account-2m-fdic-insurance\/\">$8 million in FDIC insurance<\/a> (or $16 million for joint accounts) on your Cash Account deposits through our partner banks. This is an advantage for our clients, and it’s possible because we aren’t a bank, meaning we sweep your deposits to up to 32 partner banks ($250,000 x 32 = $8 million) at any given time. Every one of our partner banks is FDIC insured. <strong>As a result, you get 32x the FDIC insurance at Wealthfront you’d get with a regular bank account. <\/strong>This means your funds are arguably much safer at Wealthfront than they would be at a traditional bank.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Our investing accounts have up to $500,000 in SIPC insurance<\/h3>\n\n\n\n<p>SIPC insurance is also an important factor in evaluating how safe your savings are at a brokerage firm. This insurance is provided by the Securities Investor Protection Corporation, and it protects the cash and investments in your brokerage accounts in the event that your brokerage fails and your savings go missing. (It’s important to note that SIPC insurance does <em>not <\/em>protect against decreases in the value of your investments due to market movement — that’s just a normal risk associated with investing.) SIPC insurance covers up to $500,000 in total value per customer, half of which can be in cash. Wealthfront is a SIPC-insured brokerage, and thus your investing account at Wealthfront is covered by SIPC insurance.<\/p>\n\n\n\n<p>Some investors might feel nervous if their account value exceeds $500,000 because of the limit on SIPC insurance. We don’t think this is cause for concern, as it’s historically been exceptionally rare for SIPC insurance to actually become necessary. Between 2014 and 2021, SIPC has only had <a href=\"https:\/\/www.sipc.org\/media\/annual-reports\/2021-annual-report.pdf\">two new cases<\/a> where they had to oversee liquidation because client assets were not fully available. This is because financial regulators have implemented many safeguards (like keeping investors’ securities separate from the brokerage’s assets — more on that below) that make it quite difficult for an investor to lose cash or securities when a brokerage fails. Even when a brokerage firm does fail, <a href=\"https:\/\/www.sipc.org\/about-sipc\/history\">99%<\/a> of people who are eligible for SIPC insurance at the failed brokerage firm have all their funds\/investments returned to them in SIPC liquidations.<\/p>\n\n\n\n<p>Finally, SIPC insurance doesn’t just protect the assets in your investing accounts at Wealthfront —&nbsp;it also protects your Cash Account deposits (up to $250,000) when they’re in transit to a partner bank. Once your funds are deposited at a partner bank, they’re covered by FDIC insurance as we described above. Because of this, you can feel confident that your funds are well protected no matter what kind of Wealthfront account they’re in, even if they take a day to land at one of our FDIC-insured partner banks.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront complies with the rules of two federal regulators: the SEC and FINRA<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\">We’re regulated by the SEC<\/h3>\n\n\n\n<p>The Securities and Exchange Commission, or SEC, is a federal agency devoted to overseeing the entire securities industry in the United States. The SEC enforces compliance with securities laws and also regulates the investment industry by writing rules and regulations designed to protect investors and maintain the integrity of the securities markets. Wealthfront is regulated by the SEC and, as a result, complies with an extensive set of rules and regulations set by the agency, including those designed to make sure client assets are safe at all times. The SEC regularly conducts scheduled and surprise audits, known as exams, to confirm companies in the industry are following these rules.&nbsp;<\/p>\n\n\n\n<p>One example of an SEC rule that keeps Wealthfront client funds safe is the <a href=\"https:\/\/www.sec.gov\/tm\/infosmallbussecgbd-financial-resp-secg#:~:text=Net%20Capital%20Rule%20\">Customer Protection Rule<\/a>, which prevents broker-dealers like Wealthfront Brokerage from commingling client funds or securities with the assets of the brokerage firm, including the funds the brokerage uses to cover its own expenses. Mixing these funds would be a major violation, and we take our responsibility to keep them separate extremely seriously. We confirm every day that all client assets are being held safely either at our partner banks (in the case of Cash Account deposits) or our clearing firm (in the case of investing account assets) where they are completely segregated from Wealthfront Brokerage’s own funds and securities. This segregation of client assets from brokerage assets minimizes any risk that client funds could not be returned when requested. As a result, we’re extremely well prepared to process a high volume of withdrawals, even if they were to occur within a very short period of time.&nbsp;<\/p>\n\n\n\n<p>The same rule also requires Wealthfront to maintain what’s called a Special Reserve Account for the benefit of customers. On a weekly basis and at the end of every month, Wealthfront performs the required “Reserve Requirement Calculation,” which measures any difference between client credits and client debits, and transfers cash in the amount of that difference to be held in reserve in the Special Reserve Account for safekeeping. The clearing firm where we hold the assets in Wealthfront’s investing accounts is required to follow this rule as well.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">We’re regulated by FINRA<\/h3>\n\n\n\n<p>FINRA is another of Wealthfront’s important regulators. While the SEC oversees a broad swath of the financial industry, FINRA is authorized by the SEC to focus on broker-dealers specifically. FINRA’s oversight helps keep Wealthfront client funds safe in a number of ways. In addition to implementing its own set of extensive rules for broker-dealers, FINRA (like the SEC)&nbsp; conducts regular and surprise exams of Wealthfront (as they do all brokerage firms) to ensure we’re following SEC and FINRA rules. Exams encompass topics as far-ranging as a firm’s trading activity, anti-money laundering efforts, cybersecurity, and accuracy of books and records, just to name a few. During these exams, FINRA requests and reviews evidence that the broker-dealer has taken and implemented feedback from past exams and is keeping up with current requirements. FINRA also conducts targeted exams called “sweeps” to gather information and carry out investigations. Sweeps help FINRA understand how firms are responding to new or emerging regulatory issues so they can make future exams even more thorough.&nbsp;&nbsp;<\/p>\n\n\n\n<p>One example of a FINRA rule that keeps Wealthfront client funds safe is <a href=\"https:\/\/www.finra.org\/rules-guidance\/rulebooks\/finra-rules\/3310\">Rule 3310<\/a>, which requires us to maintain an anti-money laundering program that includes thorough monitoring of client accounts to look for suspicious activity, including potential instances of account takeover and identity theft. We have trained experts on staff who specialize in the prevention of financial crimes and money laundering. With their knowledge and experience, Wealthfront is very well positioned to quickly identify the presence of bad actors on our platform and prevent those bad actors from stealing client funds. Every withdrawal on Wealthfront’s platform is subject to automated monitoring that evaluates transactions according to parameters designed to identify unusual behavior. Potentially suspicious transactions are escalated to our team for human review when necessary.<\/p>\n\n\n\n<p>Put simply, the rules our regulators put in place touch on a wide range of processes within Wealthfront. We believe the safeguards required by our regulators are a crucial part of protecting client funds, and we dedicate many resources and great care to ensuring we’re following them. On top of all of this, Wealthfront Brokerage undergoes an annual, independent audit by a big-four accounting firm to make sure our control framework, statements, and books and records entries are all accurate.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront protects the security of your accounts<\/h2>\n\n\n\n<p>We’ve written at length about the <a href=\"https:\/\/www.wealthfront.com\/blog\/thoughts-security\/\">robust security practices at Wealthfront<\/a>&nbsp;in the past, and we’re proud to uphold these practices so our clients can feel confident about the safety of their accounts. These practices include, but are not limited to, the following:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>We’ve designed our internal systems to follow best practices for “least privilege.” This means we only grant employees access to systems they absolutely need to do their jobs, which reduces the potential for an attacker to gain access to information they shouldn’t have.&nbsp;<\/li>\n\n\n\n<li>Our internal security team works tirelessly to understand and mitigate possible risks to our company and platform. We are constantly looking for opportunities to further improve the security of our systems.&nbsp;<\/li>\n\n\n\n<li>We never rent, sell or trade client information to anyone, for any reason.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront is an exceptionally safe place for your savings<\/h2>\n\n\n\n<p>At Wealthfront, your trust is our priority. We know clients use Wealthfront to save for big life milestones, cover everyday expenses, and ultimately build long-term wealth on their own terms. We want to be your trusted ally as you do this, so in addition to offering our best-in-class <a href=\"https:\/\/www.wealthfront.com\/cash\">Cash Account<\/a> and i<a href=\"https:\/\/www.wealthfront.com\/investing\">nvesting accounts<\/a>, we also do everything in our power to ensure the safety and security of those accounts. You can count on us to remain vigilant so Wealthfront continues to be a safe and secure place to build your long-term wealth.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you’re building your savings and managing your finances, it’s important to keep your money somewhere safe. Wealthfront is an exceptionally safe place to keep your savings — arguably much safer than other financial institutions. We know many of our clients are eager to understand the details, and we’re proud to share them. At Wealthfront, [&hellip;]<\/p>\n","protected":false},"author":10000,"featured_media":14327,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1360],"tags":[],"coauthors":[2511],"class_list":["post-16148","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-product-news"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Wealthfront Keeps Your Savings Safe | Wealthfront<\/title>\n<meta name=\"description\" content=\"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Wealthfront Keeps Your Savings Safe\" \/>\n<meta property=\"og:description\" content=\"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2023-01-05T22:01:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-10-10T21:47:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"450\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Nathaniel Gandy, CFP\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How Wealthfront Keeps Your Savings Safe\" \/>\n<meta name=\"twitter:description\" content=\"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nathaniel Gandy, CFP\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/\",\"name\":\"How Wealthfront Keeps Your Savings Safe | Wealthfront\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg\",\"datePublished\":\"2023-01-05T22:01:48+00:00\",\"dateModified\":\"2023-10-10T21:47:48+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\"},\"description\":\"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg\",\"width\":1200,\"height\":450},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Wealthfront Keeps Your Savings Safe\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\",\"name\":\"Elizabeth Rowe\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How Wealthfront Keeps Your Savings Safe | Wealthfront","description":"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/","og_locale":"en_US","og_type":"article","og_title":"How Wealthfront Keeps Your Savings Safe","og_description":"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.","og_url":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/","og_site_name":"Wealthfront Blog","article_published_time":"2023-01-05T22:01:48+00:00","article_modified_time":"2023-10-10T21:47:48+00:00","og_image":[{"width":1200,"height":450,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg","type":"image\/jpeg"}],"author":"Nathaniel Gandy, CFP","twitter_card":"summary_large_image","twitter_title":"How Wealthfront Keeps Your Savings Safe","twitter_description":"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.","twitter_image":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Nathaniel Gandy, CFP","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/","url":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/","name":"How Wealthfront Keeps Your Savings Safe | Wealthfront","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg","datePublished":"2023-01-05T22:01:48+00:00","dateModified":"2023-10-10T21:47:48+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563"},"description":"Wealthfront is an exceptionally safe place to keep your savings. Here’s exactly what you need to know.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/09\/META-IMAGE.jpg","width":1200,"height":450},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/how-wealthfront-keeps-your-savings-safe\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"How Wealthfront Keeps Your Savings Safe"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563","name":"Elizabeth Rowe","url":"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/16148","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/10000"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=16148"}],"version-history":[{"count":17,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/16148\/revisions"}],"predecessor-version":[{"id":16808,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/16148\/revisions\/16808"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/14327"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=16148"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=16148"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=16148"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=16148"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}