{"id":17098,"date":"2024-04-11T09:45:57","date_gmt":"2024-04-11T16:45:57","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=17098"},"modified":"2024-04-11T09:45:58","modified_gmt":"2024-04-11T16:45:58","slug":"tax-loss-harvesting-results-2023","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/","title":{"rendered":"How Wealthfront’s Tax-Loss Harvesting Performed in 2023"},"content":{"rendered":"\n<p><a href=\"https:\/\/www.wealthfront.com\/tax-loss-harvesting\">Wealthfront’s Tax-Loss Harvesting<\/a> is designed to help lower your tax bill without any extra effort and at no additional cost. The strategy is so powerful that Wealthfront’s Chief Investment Officer Burton Malkiel <a href=\"https:\/\/www.wealthfront.com\/blog\/10-years-of-tax-loss-harvesting\/\">called it<\/a> “the only reliable way for investors to outperform the market, as it allows you to do so on an after-tax basis.” <\/p>\n\n\n\n<p>Tax-Loss Harvesting, which is available to all Wealthfront clients with taxable <a href=\"https:\/\/www.wealthfront.com\/investing\">Automated Investing Accounts<\/a>, generated significant potential savings for clients in 2023:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Estimated tax savings in 2023: <\/strong>Last year alone, our software harvested $256 million in total losses to help lower clients’ taxes (with $2.7 billion harvested over the last five years and $3.4 billion over the last decade). Based on our clients’ current self-reported income, state of residence, and tax-filing status (e.g., single, married filing jointly) we infer a combined federal and state tax rate for each client. We then multiply each client’s rate by their losses, which <strong>adds up to a total estimated tax benefit of $83.4 million in 2023.<\/strong><\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Estimated after-tax benefit over the last decade:<\/strong> Using the same methodology described above to infer clients’ tax rates, we calculate daily tax benefit as a percentage of total account value for each cohort and then add up and annualize the daily values over time. We find that for clients who use Tax-Loss Harvesting in a Classic portfolio, our software has harvested enough losses to generate an average annual estimated tax benefit worth 1.63% of their portfolio value over the last decade. This translates to an <strong>average annual after-tax benefit worth 6.5 times our 0.25% annual advisory fee. <\/strong><br><\/li>\n\n\n\n<li><strong>Clients we estimate have had their fees totally covered by Tax-Loss Harvesting: <\/strong>When we use each client’s inferred tax rate to estimate their benefit from Tax-Loss Harvesting and compare that benefit to the actual amount they paid in advisory fees, the result is that for<strong> over 97% of participating clients who have used Tax-Loss Harvesting for at least a year, the estimated tax benefit exceeds fees paid.<\/strong><\/li>\n<\/ul>\n\n\n\n<p>Transparency is important to us at Wealthfront, and that’s why we consistently publish the results of our Tax-Loss Harvesting service so you can clearly see the benefit it offers. As far as we know, we are the only robo-advisor to do this. You shouldn’t necessarily assume other tax-loss harvesting services will offer the same benefit as ours—not all tax-loss harvesting software is the same, and we’ve worked hard to build what we believe is the best available. <\/p>\n\n\n\n<p>In this post, we’ll review the basics of tax-loss harvesting and take a more detailed look at how Wealthfront’s Tax-Loss Harvesting performed through the end of 2023.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The basics of tax-loss harvesting<\/h2>\n\n\n\n<p>Tax-loss harvesting is a tax deferral and tax-minimization strategy where you sell investments that have declined below their purchase price and then replace them with similar investments. Doing this means your portfolio keeps the same general risk and return characteristics, but you get to “harvest” a loss. And when you file your tax return, you can use harvested losses to offset capital gains and, if you have any left over, up to $3,000 of ordinary income for the year. Additional unused losses can be rolled over to future years.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How does tax-loss harvesting save you money?<\/h2>\n\n\n\n<p>Tax-loss harvesting saves you money in two ways:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Tax minimization:<\/strong> Tax-loss harvesting can be a tax-minimization strategy in the form of tax-rate arbitrage. That’s because tax-loss harvesting can allow you to offset short-term capital gains (which are typically taxed as ordinary income, which are currently taxed at up to 37% at the federal level) today and pay long-term capital gains rates (which currently top out at 20% at the federal level) when you eventually sell your investments in the future, provided you hold them for at least a year. Keep in mind that your ability to do this depends on your future tax rates and when you decide to sell your investments.<\/li>\n\n\n\n<li><strong>Tax deferral<\/strong>: Tax-loss harvesting can also help you push paying your taxes into the future. This is valuable because of the <a href=\"https:\/\/www.investopedia.com\/terms\/t\/timevalueofmoney.asp\">time value of money<\/a>. Consider that money you save by not paying taxes today can be invested, meaning it has the potential to be worth more in the future when you do eventually pay taxes. Keep in mind, however, that there’s a potential risk that your tax rate will go up in that time and your eventual tax cost could exceed the benefit you received from reinvestment.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Wealthfront’s 2023 Tax-Loss Harvesting results<\/h2>\n\n\n\n<p>At Wealthfront, we use “harvesting yield” to measure the benefit of our Tax-Loss Harvesting. To calculate it, we take the daily amount of harvested losses and divide by daily AUM. Then we calculate the average of those values and multiply it by the total number of trading days in a year to get annualized harvesting yield. When harvesting yield is high, that means our software found and took advantage of more opportunities to harvest losses.<\/p>\n\n\n\n<p>The table below shows dollar-weighted average annual harvesting yield for clients with a Classic portfolio with a risk score of 8 (the risk score more commonly chosen by clients using Tax-Loss Harvesting), sorted by the year they first started using Tax-Loss Harvesting (we call this the “client vintage”).<\/p>\n\n\n\n<p><strong>Average annual harvesting yield for Classic portfolios with a risk score of 8 through 2023<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1214\" height=\"330\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.34.10 AM.png\" alt=\"Table showing average annual harvesting yield for Classic portfolios with a risk score of 8 through 2023\n\" class=\"wp-image-17099\" style=\"width:839px;height:auto\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.34.10 AM.png 1214w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.34.10 AM-640x174.png 640w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.34.10 AM-768x209.png 768w\" sizes=\"auto, (max-width: 1214px) 100vw, 1214px\" \/><figcaption class=\"wp-element-caption\">Source: Wealthfront<\/figcaption><\/figure>\n\n\n\n<p>The table above focuses on risk score 8 portfolios because they’re the most common among Wealthfront clients using Tax-Loss Harvesting. But you should know that our software has harvested significant losses for clients with other risk scores, too. The dollar-weighted average annual harvesting yield for clients using Tax-Loss Harvesting in a Classic portfolio across all vintages and risk scores is 5.44% over the last decade (5.11% over the last 5 years, and 1.23% over the last year). <\/p>\n\n\n\n<p>That harvesting yield can translate into real benefit for our clients. As we described above, we estimate the average annual after-tax benefit for all clients using Tax-Loss Harvesting in a Classic portfolio of any client vintage and risk score over the last decade is 1.63%, which is over 6.5 times Wealthfront’s annual advisory fee. In short, Tax-Loss Harvesting generates potential after-tax benefit that can <em>significantly<\/em> outweigh the cost of our service. <strong>Put another way, you’re likely to come out ahead on cost using Wealthfront’s Tax-Loss Harvesting compared to managing your own portfolio for no advisory fee.<\/strong><\/p>\n\n\n\n<p>The analysis above only includes our Classic portfolios (our most popular portfolio) but it’s also important to note that our Socially Responsible portfolio, which we launched in late 2021, has had similar Tax-Loss Harvesting results over the same time period.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The average annual harvesting yield for our all Socially Responsible portfolios across risk scores and client vintages in 2023 was 3.00% (vs. 3.07% for our Classic portfolio).<\/li>\n\n\n\n<li>The average annual harvesting yield for all Socially Responsible portfolios across risk scores and client vintages since the portfolios’ inception in late 2021 was 11.56% (vs 10.63% for Classic portfolios over the same period).<\/li>\n<\/ul>\n\n\n\n<p>If you had a customized portfolio at Wealthfront (we launched these in mid 2021) you also continued to benefit from Tax-Loss Harvesting in 2023:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The average annual harvesting yield for all customized portfolios at Wealthfront across all client vintages in 2023 was 3.66%.<\/li>\n\n\n\n<li>The average annual harvesting yield for all customized portfolios at Wealthfront across client vintages since the inception of custom portfolios at Wealthfront in mid 2021 was 10.38%.<\/li>\n<\/ul>\n\n\n\n<p>Because our <a href=\"https:\/\/www.wealthfront.com\/automated-bond-portfolio\">Automated Bond Portfolios<\/a> are so new (introduced in mid 2023), we did not include them in our analysis for this post. To learn more about the performance of our <a href=\"https:\/\/www.wealthfront.com\/explore\/portfolios\/core-di\/direct-indexing\">US Direct Indexing portfolios<\/a> (which feature a more advanced form of Tax-Loss Harvesting), check out our <a href=\"https:\/\/research.wealthfront.com\/whitepapers\/stock-level-tax-loss-harvesting\/\">US Direct Indexing white paper<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Why not just harvest losses at the end of the year?<\/h2>\n\n\n\n<p>You might think of tax-loss harvesting as a strategy to use at the end of the year in a last-ditch effort to lower your tax bill, but it’s even more powerful when you look for opportunities to harvest losses all year long like Wealthfront’s software does. Fewer than half of the losses Wealthfront harvested in unmodified Classic and Socially Responsible portfolios in 2023 (41.7%) were harvested in the final quarter of the year, the time of year that many people who manually conduct tax-loss harvesting are inclined to do so (with 22.9% harvested in Q4 over the last 5 years and 29.2% in Q4 over the last decade). In other words,<strong> if you waited until the end of the year to manually harvest losses instead of automating it year-round with Wealthfront, you likely missed out.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How much benefit will you get from Tax-Loss Harvesting?<\/h2>\n\n\n\n<p>Your situation is unique, so the actual benefit you personally receive from Tax-Loss Harvesting will likely be higher or lower than the average figures presented in this post. Some factors that affect the benefit you’ll receive from Tax-Loss Harvesting are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>The riskiness of your portfolio.<\/strong> Riskier portfolios are generally more volatile, and more volatility usually means more opportunities to harvest losses.<\/li>\n\n\n\n<li><strong>When you make deposits.<\/strong> If you make one large deposit and never add more, <a href=\"https:\/\/www.wealthfront.com\/blog\/risk-and-time-horizon\/\">it gets harder to harvest losses over time<\/a>. Frequent add-on deposits, however, mean you’ll have more tax lots in your portfolio and it’s more likely our software will be able to harvest losses.<\/li>\n\n\n\n<li><strong>Your marginal tax rate.<\/strong> The higher your marginal tax rate, the more you’ll save when you use losses to offset taxable gains. If you live in a high tax state and have a high income, you’re likely to get more benefit than someone in a lower tax bracket in a lower tax state.<\/li>\n\n\n\n<li><strong>Your ability to use losses<\/strong>. It’s possible that you won’t realize enough capital gains each year to use all of your harvested losses. You might even have unused losses after offsetting up to $3,000 of ordinary income. That’s okay—you can use leftover losses in future years.<\/li>\n\n\n\n<li><strong>Wash sales.<\/strong> Occasionally, some benefit from Tax-Loss Harvesting can be lost to <a href=\"https:\/\/www.investopedia.com\/terms\/w\/washsale.asp\">wash sales<\/a>. Wash sales are relatively rare at Wealthfront (they affect less than 0.01% of the average daily dollars traded, excluding withdrawals) because our software is designed to avoid them across all of your Automated Investing accounts with us. When a wash sale does occur, it’s not a big problem—you just have to wait a year to realize the loss associated with that transaction.<\/li>\n\n\n\n<li><strong>Suitable alternates. <\/strong>Some investments offered at Wealthfront aren’t eligible for Tax-Loss Harvesting because we don&#8217;t have suitable alternate ETFs available for them. This can lower your harvesting yield. You can always check to see if an ETF available at Wealthfront has a Tax-Loss Harvesting alternate by <a href=\"https:\/\/www.wealthfront.com\/explore\">searching for specific investments here<\/a>.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">A powerful tax-minimization strategy in all market conditions<\/h2>\n\n\n\n<p>At Wealthfront, we believe what sets us apart is our focus on improving your after-tax returns. We want to maximize your after-tax returns whether the market is up (as it generally was last year) or down, and, although performance depends on market conditions, our Tax-Loss Harvesting service has a demonstrated track record of generating potential tax savings for clients in both scenarios. We are delighted to offer it to you at no additional cost. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wealthfront’s Tax-Loss Harvesting is designed to help lower your tax bill without any extra effort and at no additional cost. The strategy is so powerful that Wealthfront’s Chief Investment Officer Burton Malkiel called it “the only reliable way for investors to outperform the market, as it allows you to do so on an after-tax basis.”  [&hellip;]<\/p>\n","protected":false},"author":10000,"featured_media":17100,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1360],"tags":[],"coauthors":[1270,2433],"class_list":["post-17098","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-product-news"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Wealthfront’s Tax-Loss Harvesting: 2023 Results<\/title>\n<meta name=\"description\" content=\"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Wealthfront’s Tax-Loss Harvesting: 2023 Results\" \/>\n<meta property=\"og:description\" content=\"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-11T16:45:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-11T16:45:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1250\" \/>\n\t<meta property=\"og:image:height\" content=\"470\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Alex Michalka, Ph.D, Fang Rui, CFA\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Alex Michalka, Ph.D, Fang Rui, CFA\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/\",\"name\":\"Wealthfront’s Tax-Loss Harvesting: 2023 Results\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png\",\"datePublished\":\"2024-04-11T16:45:57+00:00\",\"dateModified\":\"2024-04-11T16:45:58+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\"},\"description\":\"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png\",\"width\":1250,\"height\":470},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Wealthfront’s Tax-Loss Harvesting Performed in 2023\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\",\"name\":\"Elizabeth Rowe\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Wealthfront’s Tax-Loss Harvesting: 2023 Results","description":"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/","og_locale":"en_US","og_type":"article","og_title":"Wealthfront’s Tax-Loss Harvesting: 2023 Results","og_description":"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.","og_url":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/","og_site_name":"Wealthfront Blog","article_published_time":"2024-04-11T16:45:57+00:00","article_modified_time":"2024-04-11T16:45:58+00:00","og_image":[{"width":1250,"height":470,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png","type":"image\/png"}],"author":"Alex Michalka, Ph.D, Fang Rui, CFA","twitter_card":"summary_large_image","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Alex Michalka, Ph.D, Fang Rui, CFA","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/","url":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/","name":"Wealthfront’s Tax-Loss Harvesting: 2023 Results","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png","datePublished":"2024-04-11T16:45:57+00:00","dateModified":"2024-04-11T16:45:58+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563"},"description":"Wealthfront’s Tax-Loss Harvesting service helped many clients lower their tax bills in 2023. Read on for more details.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/04\/Screenshot-2024-04-11-at-9.44.07 AM.png","width":1250,"height":470},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/tax-loss-harvesting-results-2023\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"How Wealthfront’s Tax-Loss Harvesting Performed in 2023"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563","name":"Elizabeth Rowe","url":"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17098","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/10000"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=17098"}],"version-history":[{"count":3,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17098\/revisions"}],"predecessor-version":[{"id":17103,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17098\/revisions\/17103"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/17100"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=17098"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=17098"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=17098"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=17098"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}