{"id":17248,"date":"2024-07-11T09:56:55","date_gmt":"2024-07-11T16:56:55","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=17248"},"modified":"2024-07-11T10:05:46","modified_gmt":"2024-07-11T17:05:46","slug":"bond-ladders","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/","title":{"rendered":"Bond Ladders: What You Need To Know"},"content":{"rendered":"\n<p>Bond ladders may be a <a href=\"https:\/\/www.wsj.com\/finance\/investing\/bond-ladder-investing-strategy-93c892f7?mod=hp_jr_pos2\">buzzy investment strategy<\/a> at the moment, but they&#8217;re more than just a passing trend. Bond ladders are also a time-tested approach for investors who want to protect and grow a windfall or save for a future purchase. But what are bond ladders, and who can potentially benefit from using them?&nbsp;<\/p>\n\n\n\n<p>First, let’s define a few key terms we’ll use in this article:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Bond:<\/strong> A bond is a debt security issued by a government, governmental agency, or company. When you buy a bond, you are essentially lending money to the issuer for a fixed period. In return, the issuer promises to pay you back, usually with interest (more on that below).<\/li>\n\n\n\n<li><strong>Maturity:<\/strong> When you buy a bond, maturity is the date upon&nbsp; which your principal is due to be returned by the issuer.<\/li>\n\n\n\n<li><strong>Rung:<\/strong> A bond ladder has “rungs,” and each rung represents a bond (or bonds) maturing on a specific date.<\/li>\n\n\n\n<li><strong>Principal: <\/strong>This is the amount of the investment (again, it’s a bit like a “loan”you are making to the bond issuer) in the bond. Assuming the issuer does not default or call the bond, you receive the principal back at maturity.&nbsp;<\/li>\n\n\n\n<li><strong>Interest: <\/strong>This is the amount the issuer pays you to compensate you for the “loan.” A bond&#8217;s yield measures the annual interest paid relative to its price. The annual interest rate is often referred to as the “coupon rate,” and it’s typically paid twice a year.<\/li>\n<\/ul>\n\n\n\n<p>With these terms in mind, here’s a primer on the basics of bond ladders.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is a bond ladder?<\/h2>\n\n\n\n<p>A <a href=\"https:\/\/www.wealthfront.com\/automated-bond-ladder\">bond ladder<\/a> is a portfolio of bonds with different maturity dates, which are staggered at intervals like the rungs of a ladder. For example, a six-month bond ladder might contain six rungs, with a rung maturing in one month, two months, three months, four months, five months, and six months. In a month’s time, one rung will mature (assuming the issuer does not default in that time) and the other rungs will each be one month closer to maturity.&nbsp;<\/p>\n\n\n\n<p>As bonds in the ladder pay interest and mature, you can either reinvest that money in a new bond (generally this will be the new “longest rung” of your ladder with the longest time to maturity) or take cash out of the portfolio. In the example above, if you wanted to reinvest in the ladder after one month, you could use the proceeds from the matured bond to buy a new bond maturing in six months.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Why use a bond ladder?<\/h2>\n\n\n\n<p>Bond ladders allow you to earn regular interest payments over time, and usually offer a <a href=\"https:\/\/www.wealthfront.com\/automated-bond-ladder#compare\">higher yield<\/a> than you’d be able to get on your cash in a savings account. Depending on the type of bond you invest in, you may be able to get these benefits without much risk to your principal.&nbsp;<\/p>\n\n\n\n<p>For instance, if you build a bond ladder with US Treasuries, you can earn interest on those Treasuries with very little risk to your principal (as long as the US government doesn’t default, which to date, has never happened). For this reason, Treasury ladders in particular are often considered good for capital preservation: They provide a way to grow your money and protect your principal at the same time.&nbsp;<\/p>\n\n\n\n<p>Bond ladders are popular with investors who are saving for a future expense like a down payment or sending a child to college. They can also make sense for investors who want to balance out other, riskier investments.<\/p>\n\n\n\n<p>When they’re built with tax-advantaged bonds like US Treasuries, bond ladders can have tax benefits compared to other fully taxed accounts like a savings account or CD. They can also help you “lock in” an interest rate on your savings, which can be valuable if you expect interest rates to fall. Finally, bond ladders are a more diversified way to invest in bonds (compared to owning an individual bond) because you are more diversified against interest rate risk, or the rate that interest rates will change and affect your potential earnings. Here’s a closer look at the details of these benefits.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What are the tax benefits of a bond ladder, and who can benefit most?<\/h2>\n\n\n\n<p>The tax benefits of a bond ladder depend on the type of bond used to build the ladder. Three common types of bonds are corporate bonds (issued by companies), municipal bonds (issued by cities, counties, and states), and US Treasuries (issued by the US government).&nbsp;<\/p>\n\n\n\n<p>The table below shows the basics at a glance, but you should speak with a tax professional if you have questions about your personal tax situation.<\/p>\n\n\n\n<figure class=\"wp-block-table is-style-stripes has-small-font-size\"><table class=\"has-fixed-layout\"><thead><tr><th><strong>Bond type<\/strong><\/th><th><strong>Default risk<\/strong><\/th><th><strong>Pre-tax yield<\/strong><\/th><th><strong>Interest taxed at federal level?<\/strong><\/th><th><strong>Interest taxed at state level?<\/strong><\/th><\/tr><\/thead><tbody><tr><td><strong>Corporate bonds<\/strong><\/td><td>Highest<\/td><td>Highest<\/td><td>Yes<\/td><td>Yes<\/td><\/tr><tr><td><strong>Municipal bonds<\/strong><\/td><td>Lower than corporates; higher than Treasuries<\/td><td>Lowest (but highest potential tax exemption)<\/td><td>No<\/td><td>In most cases, no – as long as you live in the state that issued the bond<\/td><\/tr><tr><td><strong>US Treasuries<\/strong><\/td><td>Very low&nbsp;<\/td><td>Lower than corporates; higher than munis&nbsp;<\/td><td>Yes<\/td><td>No<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>If you build a ladder with bonds whose interest is not taxed at the federal and\/or state and local level, you stand to benefit more if the taxes you would otherwise pay are high. For example, if you are a high earner in a high-tax state like California, your ability to benefit from a Treasury bond ladder could be significant, because the top California marginal tax rate is currently 13.3% (which means you could keep up to 13.3% more of the interest you earn on Treasuries).&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How can a bond ladder help you “lock in” an interest rate?<\/h3>\n\n\n\n<p>You may have heard that bond ladders can help you “lock in” an interest rate on your savings, which can be helpful <a href=\"https:\/\/www.cmegroup.com\/markets\/interest-rates\/cme-fedwatch-tool.html\">if you expect interest rates to decline<\/a>. That’s because the interest rate you earn on a bond is determined at the time the bond is issued. Even if interest rates fall and newly issued bonds have lower interest rates, you’ll continue to earn the same yield on the bond you already own until maturity, assuming you don’t sell it or it isn’t recalled by the issuer. Keep in mind, however, that the average yield of your ladder as a whole will continue to change over time as some bonds mature and you purchase new ones.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How do bond ladders help with diversification?<\/h3>\n\n\n\n<p>Bond ladders can help you limit your exposure to interest rate risk compared to investing in a portfolio of bonds that all have the same maturity date. That’s because the value of a bond is sensitive to interest rate changes, and that sensitivity varies based on the timing and size of the payments. When you invest in a portfolio of bonds with different maturities, you are diversifying the risk that all of the bonds you own respond broadly and negatively to changing conditions, or at least the extent to which this can happen.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What are the risks of a bond ladder?<\/h3>\n\n\n\n<p>No matter how you choose to invest your money, there’s virtually always some risk involved. In general, that’s why investing has higher expected returns than just holding your money in cash. There are a few kinds of risk it’s helpful to understand if you plan to invest in a bond ladder.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Interest rate risk:<\/strong> This is the risk that the price of a bond will change because interest rates change. If interest rates rise, the value of previously-issued bonds with lower rates will decrease because investors will naturally prefer newly-issued bonds with higher rates. Because of this, there’s a related risk that if you need to sell some or all of the bonds in your bond ladder before maturity, you could lose some principal if the bonds have decreased in value and you need to sell it for less than what you initially paid.<\/li>\n\n\n\n<li><strong>Credit risk, or default risk:<\/strong> This is the risk that the bond issuer won’t pay you interest and\/or return your principal to you when the bond matures.<\/li>\n\n\n\n<li><strong>Reinvestment risk:<\/strong> This is the risk that you’ll receive a lower yield when you reinvest the proceeds from a matured rung of your bond ladder.<\/li>\n\n\n\n<li><strong>Recall risk: <\/strong>Some bonds are “callable,” which means the issuer can pay them off before they mature. Municipal bonds and corporate bonds may be callable, while Treasury bonds generally are not.<\/li>\n\n\n\n<li><strong>Opportunity cost:<\/strong> This is the risk that your bond ladder will underperform relative to bonds issued at higher rates in the future (this could happen in a rising rate environment).<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What happens when a bond ladder matures?<\/h2>\n\n\n\n<p>Eventually, the bonds in your bond ladder will mature if you don’t sell them (assuming they are not recalled and the issuer does not default). There are a few ways you can handle this:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Reinvest interest and principal in your ladder.<\/strong> You can use interest and proceeds from maturing bonds to invest in a new bond that becomes your new longest rung. Reinvesting in a new longest rung is called “rolling” the ladder. Reinvesting might make sense for you if you want to continue the ladder and keep growing your savings—for instance, if you’re using a bond ladder as a long-term way to balance out riskier investments.<\/li>\n\n\n\n<li><strong>Withdraw principal and interest as bonds mature:<\/strong> This is the opposite of reinvesting—when you earn interest and as bonds mature, you withdraw that money from the ladder. This might make sense if you are using your bond ladder for income.<\/li>\n\n\n\n<li><strong>Pick a target withdrawal date for your ladder: <\/strong>Another option is to decide on a date beyond which you don’t want to reinvest any proceeds from your bond ladder. In this case, you would reinvest in your ladder, but you would <em>not<\/em> reinvest in any bonds that mature after the target withdrawal date. That way, you can continue to benefit from compounding interest until the date you know you’ll need the funds.This could be a good choice if you know you’ll need the money from your bond ladder for a known future expense on a particular date, like if you know you’ll be paying for an upcoming wedding or the down payment on a home.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">How do bond ladders compare to other low-risk options?<\/h2>\n\n\n\n<p>If you are considering a bond ladder, you may also be evaluating other low-risk alternatives like a high-yield cash account or a CD. Here’s a quick overview of how bond ladders compare to these options:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Savings account: <\/strong>A savings account will likely offer a lower yield than a bond ladder, and any interest you earn will be fully taxed (whereas bond ladder interest, depending on what kind of bonds you use, might not be). Savings accounts are FDIC insured up to $250,000 (whereas bonds are typically <a href=\"https:\/\/www.wealthfront.com\/blog\/the-difference-between-fdic-and-sipc-insurance\/\">SIPC insured<\/a> up to $500,000) and are fully liquid. It’s extremely unlikely you’ll lose principal in a savings account. By comparison, some bonds have significant default risk while others, like Treasuries, have almost none. Savings accounts may charge account fees, which could be more or less expensive than the potential costs of bond ladders which include management fees, commissions, and potential losses.<\/li>\n\n\n\n<li><strong>Certificate of deposit (CD):<\/strong> A CD’s yield will vary depending on duration, and similar to a savings account, any interest you earn will be fully taxed. CDs issued by a bank are typically FDIC insured up to $250,000, and it’s also very unlikely you’ll lose principal. You may owe fees or penalties if you withdraw early, which is not the case for bond ladders. Keep in mind, however, that bond ladders come with other potential costs like management fees, commissions, and potential losses.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Key takeaways<\/h2>\n\n\n\n<p>As you can see, bond ladders have numerous benefits for investors, along with some risks. To recap:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Bond ladders are generally used to provide steady interest payments. Depending on the bonds you choose, they can also be used for capital preservation.<\/li>\n\n\n\n<li>Some bond ladders, like Treasury ladders or municipal bond ladders, may have tax benefits<\/li>\n\n\n\n<li>Bond ladders can help you “lock in” an interest rate for your cash, which can be beneficial if you expect interest rates to fall<\/li>\n\n\n\n<li>Bond ladders are more diversified against interest rate risk than owning a single bond<\/li>\n<\/ul>\n\n\n\n<p>At Wealthfront, we wanted to eliminate the hassle of researching and purchasing individual bonds and maintaining a ladder over time. <strong>That’s why we offer our <\/strong><a href=\"https:\/\/www.wealthfront.com\/automated-bond-ladder\"><strong>Automated Bond Ladder<\/strong><\/a><strong>, which is built entirely with US Treasuries so you can earn a steady yield with no state income taxes.&nbsp;<\/strong><\/p>\n\n\n\n<p>We make it easy to automatically reinvest proceeds in your ladder as bonds mature (if you’re manually managing a ladder, this can be a big headache) or to withdraw monthly principal or set a termination date for your ladder. You can also add more funds and withdraw without penalties at any time. Wealthfront’s Automated Bond Ladder is a first-of-its-kind product that makes it easier than ever to invest using this time-tested strategy.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bond ladders may be a buzzy investment strategy at the moment, but they&#8217;re more than just a passing trend. Bond ladders are also a time-tested approach for investors who want to protect and grow a windfall or save for a future purchase. But what are bond ladders, and who can potentially benefit from using them?&nbsp; [&hellip;]<\/p>\n","protected":false},"author":10000,"featured_media":17251,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1282],"tags":[],"coauthors":[2433],"class_list":["post-17248","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-investing"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bond Ladders: What You Need To Know | Wealthfront<\/title>\n<meta name=\"description\" content=\"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bond Ladders: What You Need To Know | Wealthfront\" \/>\n<meta property=\"og:description\" content=\"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2024-07-11T16:56:55+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-07-11T17:05:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"961\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Fang Rui, CFA\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Fang Rui, CFA\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/\",\"name\":\"Bond Ladders: What You Need To Know | Wealthfront\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg\",\"datePublished\":\"2024-07-11T16:56:55+00:00\",\"dateModified\":\"2024-07-11T17:05:46+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\"},\"description\":\"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg\",\"width\":2560,\"height\":961,\"caption\":\"Photo by Jan van der Wolf\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Bond Ladders: What You Need To Know\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\",\"name\":\"Elizabeth Rowe\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Bond Ladders: What You Need To Know | Wealthfront","description":"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/","og_locale":"en_US","og_type":"article","og_title":"Bond Ladders: What You Need To Know | Wealthfront","og_description":"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.","og_url":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/","og_site_name":"Wealthfront Blog","article_published_time":"2024-07-11T16:56:55+00:00","article_modified_time":"2024-07-11T17:05:46+00:00","og_image":[{"width":2560,"height":961,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg","type":"image\/jpeg"}],"author":"Fang Rui, CFA","twitter_card":"summary_large_image","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Fang Rui, CFA","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/","url":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/","name":"Bond Ladders: What You Need To Know | Wealthfront","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg","datePublished":"2024-07-11T16:56:55+00:00","dateModified":"2024-07-11T17:05:46+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563"},"description":"What are bond ladders, how do they work, and why do people use them? Here’s an explainer.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/bond-ladders\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2024\/07\/pexels-jan-van-der-wolf-11680885-26613341-scaled.jpg","width":2560,"height":961,"caption":"Photo by Jan van der Wolf"},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/bond-ladders\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"Bond Ladders: What You Need To Know"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563","name":"Elizabeth Rowe","url":"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17248","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/10000"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=17248"}],"version-history":[{"count":7,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17248\/revisions"}],"predecessor-version":[{"id":17259,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17248\/revisions\/17259"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/17251"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=17248"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=17248"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=17248"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=17248"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}