{"id":17632,"date":"2025-04-17T09:26:54","date_gmt":"2025-04-17T16:26:54","guid":{"rendered":"https:\/\/www.wealthfront.com/blog\/?p=17632"},"modified":"2025-04-17T09:31:08","modified_gmt":"2025-04-17T16:31:08","slug":"alan-ten-years-wealthfront","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/","title":{"rendered":"CFO Alan Imberman Reflects on His Decade at Wealthfront"},"content":{"rendered":"\n<p>Ten years ago, I had recently finished my MBA and was working in business valuation for a public accounting firm. Like many young professionals, I was trying to manage my own portfolio of individual stocks—researching companies, making trades, and constantly second-guessing my decisions. It was time consuming, stressful, and, frankly, not very effective. Then came a fateful conversation with a friend, who introduced me to Wealthfront. The idea of automated, sophisticated financial advice felt like a revelation. I became a client and quickly realized that Wealthfront was solving the exact challenges I was facing. I was so impressed with the product that I found myself constantly refreshing the <a href=\"https:\/\/www.wealthfront.com\/careers\">careers page<\/a> looking for a way to get involved. I applied to the first open position that mildly matched my experience, and a few weeks later I moved to Palo Alto to be Wealthfront’s first hire on the finance team. <\/p>\n\n\n\n<p>I’ll note that this seemed like a risky move at the time. I left my promising career path in public accounting in order to take this job. My wife was seven months pregnant with our first child, and my pay and lifestyle took a demotion—we sold our house, moved across the country where we didn’t know anyone, and went back to renting. Looking back, the risk was totally worth it. To this day I wake up without an alarm, not with the mindset of “going to work”, but with the mindset of building a company with a mission, products, and services I am passionate about.<\/p>\n\n\n\n<p>I still remember my first few weeks at Wealthfront very vividly. About 100 of us all sat in the same open room in Palo Alto, so close to each other we could hear our product specialists take calls from clients and colleagues working together to solve problems and try new things. Company metrics, ETF prices, operational “traffic lights,” and of course, the CalTrain schedule were tracked on a series of displays in the middle of the room like a scoreboard in a sports stadium. When I joined, the AUM dashboard read $2 billion in AUM (assets under management). Like many startups in their early days, we were growing quickly but only had an annual revenue run rate of around $6 million, which meant we were not yet profitable. Still, it was an exciting time. Wealthfront’s culture was extremely transparent and collaborative, and that has continued to this day.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1248\" height=\"712\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM.png\" alt=\"Wealthfront office in 2015\" class=\"wp-image-17633\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM.png 1248w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM-640x365.png 640w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM-929x530.png 929w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM-768x438.png 768w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.18.41 AM-280x160.png 280w\" sizes=\"auto, (max-width: 1248px) 100vw, 1248px\" \/><\/figure>\n\n\n\n<p>A decade later, our numbers look <em>very<\/em> different. In 2025, we surpassed $80 billion in total client assets and since 2023 have produced <a href=\"https:\/\/www.investopedia.com\/terms\/e\/ebit.asp#:~:text=Definition,of%20a%20business's%20core%20operations.\">earnings before interest and tax (EBIT)<\/a> or operating profit margins of over 40%, meaning we are very profitable. Our team has grown as well: We moved to a larger office in Palo Alto and now have about 330 employees who work in our office and across the country. <strong> In the last 10 years we&#8217;ve seen a huge amount of growth. Our total assets have increased by about 40x and our revenue has grown by even more: As of March, our annual revenue run rate is over $340 million or a 57x increase. This is particularly impressive given our headcount has only grown by about 3x during that time.<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1234\" height=\"576\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.20.14 AM.png\" alt=\"\" class=\"wp-image-17634\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.20.14 AM.png 1234w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.20.14 AM-640x299.png 640w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.20.14 AM-1135x530.png 1135w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.20.14 AM-768x358.png 768w\" sizes=\"auto, (max-width: 1234px) 100vw, 1234px\" \/><\/figure>\n\n\n\n<p>We’re incredibly proud of that progress, but those changes didn’t happen overnight. This growth is a direct product of our business model, our investment in software and automation, and our persistent belief that if we do the right thing for clients, the rest will take care of itself. In this post, I’ll share some of the key lessons that have driven our growth over the past 10 years. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">A client-first business model, powered by automation<\/h2>\n\n\n\n<p>I was first drawn to Wealthfront not only because they pioneered automated index investing, but also because they were putting clients first in a way that I had not seen with other financial institutions. Instead of relying on transactions, hidden fees, or expensive human advisors, we earn revenue based on our clients&#8217; assets. This means we make money with our clients, not from them, and our incentives are always aligned with helping them grow their wealth.<\/p>\n\n\n\n<p>This approach is woven into our product philosophy: We take financial products traditionally reserved for the wealthy and automate them with software to reduce costs, increase accessibility, and provide a better client experience. Every product is built with clients’ best interests in mind. We don’t chase fads or promise unrealistic get-rich-quick solutions. Instead, we build products based on academically proven strategies that are designed to help people build wealth over time. We then automate these strategies with the goals of optimizing taxes, keeping fees low, and managing risk.<\/p>\n\n\n\n<p>Our approach has been hugely successful because we’re able to serve a need (providing sophisticated investment advice) for people historically underserved by traditional options. Many investors don’t want to pay the high fees charged by financial advisors, and they don’t want to talk to advisors, either. In fact, some of our clients tell us they pay us not to talk to them! Wealthfront offers a better alternative—we deliver high-quality investing at a fraction of the cost, no appointments or phone calls required.<\/p>\n\n\n\n<p>We can offer higher quality services at a fraction of the price because our focus on automation keeps operational overhead low. As shown above, this efficient model enables us to significantly scale assets and revenue without drastically increasing headcount, and it allows us to pass on even more savings to our clients. As a result, clients benefit from higher interest rates (provided by program banks) on cash savings and lower investment fees, meaning they keep more of their money. And the results speak for themselves:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>$1 billion+<\/strong> estimated client savings in advisory fees since our founding (our advisory fee for the Automated Investing Account is 0.25% annually when compared to traditional advisers that typically charge a 1% annual advisory fee.)<\/li>\n\n\n\n<li><strong>$1 billion+<\/strong> in estimated tax savings through our <a href=\"https:\/\/www.wealthfront.com\/blog\/tax-loss-harvesting-results-2024\/\">Tax-Loss Harvesting service<\/a> since launching in late 2012<\/li>\n\n\n\n<li><strong>$3 billion+<\/strong> in interest earned by clients since the launch of the Wealthfront Cash Account<\/li>\n<\/ul>\n\n\n\n<p>From day one, we knew that by focusing solely on our clients&#8217; best interests and building products with that in mind, we could earn their trust, loyalty, and provide long-term growth for both them and the business. And it’s worked. Our clients continue to build their wealth with us, and they refer their families and friends to do the same. It’s a strong indicator of success when clients keep an average of $80,000 with us, and 50% of new clients come from referrals—that’s true organic growth.<\/p>\n\n\n\n<p>We’ve always believed that our client-first business model, powered by best-in-class automated products, would pay off over time with long-term profitability. We have mostly fixed costs (primarily employee salaries) so by automating as much as possible, we are able to keep our variable costs low and scale efficiently. We knew that once we reached a certain scale that covered our fixed costs, nearly every additional dollar would flow directly to the bottom line. It took years to hit that threshold, but now we’re there. In 2024, our gross profit margin was over 90%, and we’re still growing.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">A business model built to thrive in all market conditions<\/h2>\n\n\n\n<p>New employees often ask me if Wealthfront is prepared to weather a bear market or lower interest rates. I love answering this question because we already have many years of experience on this front. In the last decade, there have been multiple market corrections, bear markets, and bull markets. Interest rates have been as high as 5% and as low as 0%. The key to our success throughout these various environments is to offer products that are designed to help our clients grow their wealth over time and in multiple macroeconomic conditions.<\/p>\n\n\n\n<p>For example, when rates are high (like they are now), we typically see more interest in our high-yield <a href=\"https:\/\/www.wealthfront.com\/cash\">Cash Account<\/a>. In bull market years, interest in our investment products tends to increase. And rather than developing products based on short-term trends, we’ve continued to expand our product suite. We now offer fixed-income products to help clients benefit from higher interest rates with lower taxes, and we’ve added individual stocks and <a href=\"https:\/\/www.wealthfront.com\/sp500-direct\">Wealthfront’s S&amp;P 500 Direct<\/a> for clients who want more investment options.<\/p>\n\n\n\n<p>We also have the benefit of an extremely knowledgeable management team with long tenures who have lived through a wide range of market conditions. That team believes in developing a long-term strategy that allows us to grow sustainably. An example of this is how we approach our company headcount. Even when the prevailing mindset in Silicon Valley was “growth at all costs,” we were disciplined and methodical about growing headcount. To this day we have never had a layoff, which is something I’m extremely proud of. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Empowering millennials as they build wealth<\/h2>\n\n\n\n<p>Wealthfront has always believed<a href=\"https:\/\/www.wealthfront.com\/blog\/millennial-finances-five-years-after-covid\/\"> in the potential of millennials—a generation that people often underestimate<\/a>. Today, millennials are the largest generation, and are on track to be the wealthiest, too. (Gen Z is not far behind.) Wealthfront is a leading financial platform for the next generation, and new data from <a href=\"https:\/\/www.wealthfront.com\/blog\/oxford-economics-report\/\">Oxford Economics<\/a> shows that their net wealth is projected to reach $140 trillion by 2045, which presents a huge opportunity for us to continue building products and services that support their financial needs. We are growing (and will continue to grow) with millennials in much the same way that Charles Schwab grew with baby boomers. <\/p>\n\n\n\n<p>Wealthfront is a tech-driven financial platform built specifically to help millennials and young professionals turn their savings into long-term wealth. Back when we started out, “robo-advisor” was a derogatory term and industry skeptics said we’d never be profitable. It’s been fun to continue to prove them wrong. Our success over the past decade comes down to one thing: We’ve stayed true to building smart, automated products with a relentless focus on doing right by our clients. That approach has carried us far, and I really believe we&#8217;re just getting started.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ten years ago, I had recently finished my MBA and was working in business valuation for a public accounting firm. Like many young professionals, I was trying to manage my own portfolio of individual stocks—researching companies, making trades, and constantly second-guessing my decisions. It was time consuming, stressful, and, frankly, not very effective. Then came [&hellip;]<\/p>\n","protected":false},"author":10000,"featured_media":17638,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1315,1360],"tags":[],"coauthors":[2505],"class_list":["post-17632","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-insights","category-product-news"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront\" \/>\n<meta property=\"og:description\" content=\"Ten years ago, I had recently finished my MBA and was working in business valuation for a public accounting firm. Like many young professionals, I was trying to manage my own portfolio of individual stocks—researching companies, making trades, and constantly second-guessing my decisions. It was time consuming, stressful, and, frankly, not very effective. Then came [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2025-04-17T16:26:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-04-17T16:31:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1670\" \/>\n\t<meta property=\"og:image:height\" content=\"622\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Alan Imberman, CFA\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Alan Imberman, CFA\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/\",\"name\":\"10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png\",\"datePublished\":\"2025-04-17T16:26:54+00:00\",\"dateModified\":\"2025-04-17T16:31:08+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\"},\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png\",\"width\":1670,\"height\":622},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"CFO Alan Imberman Reflects on His Decade at Wealthfront\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\",\"name\":\"Elizabeth Rowe\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/","og_locale":"en_US","og_type":"article","og_title":"10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront","og_description":"Ten years ago, I had recently finished my MBA and was working in business valuation for a public accounting firm. Like many young professionals, I was trying to manage my own portfolio of individual stocks—researching companies, making trades, and constantly second-guessing my decisions. It was time consuming, stressful, and, frankly, not very effective. Then came [&hellip;]","og_url":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/","og_site_name":"Wealthfront Blog","article_published_time":"2025-04-17T16:26:54+00:00","article_modified_time":"2025-04-17T16:31:08+00:00","og_image":[{"width":1670,"height":622,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png","type":"image\/png"}],"author":"Alan Imberman, CFA","twitter_card":"summary_large_image","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Alan Imberman, CFA","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/","url":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/","name":"10 Years of Growth: CFO Alan Imberman Reflects on a Decade at Wealthfront","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png","datePublished":"2025-04-17T16:26:54+00:00","dateModified":"2025-04-17T16:31:08+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563"},"breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2025\/04\/Screenshot-2025-04-17-at-9.30.51 AM.png","width":1670,"height":622},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/alan-ten-years-wealthfront\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"CFO Alan Imberman Reflects on His Decade at Wealthfront"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563","name":"Elizabeth Rowe","url":"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17632","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/10000"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=17632"}],"version-history":[{"count":2,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17632\/revisions"}],"predecessor-version":[{"id":17637,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/17632\/revisions\/17637"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/17638"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=17632"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=17632"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=17632"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=17632"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}