{"id":4478,"date":"2024-10-24T14:33:40","date_gmt":"2024-10-24T21:33:40","guid":{"rendered":"http:\/\/www.wealthfront.com/blog\/?p=4478"},"modified":"2024-10-24T15:30:58","modified_gmt":"2024-10-24T22:30:58","slug":"high-deductible-health-plan","status":"publish","type":"post","link":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/","title":{"rendered":"HDHP vs. PPO: What You Need to Know"},"content":{"rendered":"\n<p>HDHP, PPO, HSA … the acronyms and the options can seem endless when you’re evaluating health insurance plans. Choosing the right plan is an important financial decision, and it’s wise to weigh the details carefully. In this post, we’ll dig into the tradeoffs associated with choosing a <a href=\"https:\/\/www.investopedia.com\/terms\/h\/hdhp.asp\">high-deductible health plan<\/a> (HDHP) over a traditional <a href=\"http:\/\/www.investopedia.com\/terms\/p\/preferred-provider-organization.asp\">preferred provider organization<\/a> (PPO) plan, so you can confidently choose the option that’s right for you.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a PPO?<\/strong><\/h2>\n\n\n\n<p>Let’s start with the basics. <a href=\"https:\/\/www.kff.org\/report-section\/ehbs-2023-section-5-market-shares-of-health-plans\/\">PPOs are the most common type of health insurance plan by enrollment<\/a>. When you choose a PPO, you can typically see in-network healthcare providers (including specialists) without a referral. If you want to see a provider who isn’t in your PPO’s network, you can expect paperwork and higher costs. Generally, PPOs have higher premiums than HDHPs, but much lower <a href=\"https:\/\/www.healthcare.gov\/glossary\/deductible\/\">deductibles<\/a>. Traditional PPOs do not come with the option to open a <a href=\"https:\/\/www.investopedia.com\/terms\/h\/hsa.asp\">health savings account<\/a> or HSA.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is an HDHP?<\/strong><\/h2>\n\n\n\n<p>An HDHP is another popular type of insurance plan — they’re the <a href=\"https:\/\/www.kff.org\/report-section\/ehbs-2023-section-5-market-shares-of-health-plans\/\">second-most common kind of health insurance plan after PPOs<\/a>. Any health insurance plan (including a PPO) is considered an HDHP if it has a high-enough deductible: $1,600 for an individual and $3,200 for a family in 2024 (with those numbers rising to $1,650 and $3,300 in 2025). HDHPs have a few key characteristics:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>As the name suggests, HDHPs have higher deductibles than other plans.<\/li>\n\n\n\n<li>HDHPs typically have lower premiums (or monthly insurance plan costs).<\/li>\n\n\n\n<li>HDHPs allow you to open an HSA (Health Savings Account).<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What is an HSA?<\/h2>\n\n\n\n<p>An HSA is a tax-advantaged account you can use to save for healthcare expenses. You and your employer can contribute to your HSA, and you can choose to invest the funds in the account. Your contributions are made with pre-tax dollars, meaning you can deduct your contributions from your income for tax purposes, thereby reducing your taxable income. You can withdraw the funds tax-free for qualified medical expenses, and you can take the account with you if you change jobs. HSAs are similar to the <a href=\"https:\/\/www.investopedia.com\/terms\/f\/flexiblespendingaccount.asp\">flexible spending accounts<\/a> (FSAs) that come with PPOs, but <a href=\"https:\/\/www.valuepenguin.com\/banking\/difference-between-fsa-and-hsa\">offer far more flexibility in rolling over unused funds<\/a>.<\/p>\n\n\n\n<p>There’s a notable exception to HSAs’ tax-free status: currently, there are <a href=\"https:\/\/www.forbes.com\/sites\/megangorman\/2019\/06\/17\/why-your-state-might-be-sabotaging-your-retirement-strategy\/?sh=52135c286d48\">two states that don’t conform to federal tax treatment of HSAs<\/a>. In New Jersey and California, HSA contributions and any realized capital gains are considered taxable income at the state level. Taxpayers are required to report these realized gains on their tax returns, as most brokerages that handle the HSAs don’t send any tax forms.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">HDHP vs. PPO: Which plan is best for you?<\/h2>\n\n\n\n<p>When you evaluate a health insurance plan, there are a few key numbers you should pay attention to:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Annual premium<\/strong>: What you’ll pay each year just to have insurance. Usually, this will come out of your paycheck.<\/li>\n\n\n\n<li><strong>Deductible:<\/strong> The amount of money you need to spend on healthcare (not including your premiums) before your insurance starts to chip in. Keep in mind that <a href=\"https:\/\/www.verywellhealth.com\/preventive-care-whats-free-whats-not-1739003\">preventative care is generally covered in full even before you hit your deductible<\/a>.<\/li>\n\n\n\n<li><strong>Coinsurance:<\/strong> The percentage of healthcare costs you pay after hitting your deductible, but before you hit your out-of-pocket max.<\/li>\n\n\n\n<li><strong>Out-of-pocket max:<\/strong> The maximum amount of money you will spend out-of-pocket on healthcare that year. This includes your deductible, but not your premiums. After you hit this maximum, your insurance covers 100% of your healthcare costs.<\/li>\n\n\n\n<li><strong>Employer HSA contribution:<\/strong> Money your employer gives you for your HSA.&nbsp;<\/li>\n<\/ul>\n\n\n\n<p>You can use these numbers and the formulas below to compare the attractiveness of various healthcare plans offered by your employer.&nbsp; The first formula assumes you expect to hit your deductible. The variable X represents what you expect to spend on healthcare costs this year.<\/p>\n\n\n\n<p class=\"has-text-align-center\"><strong>Net costs = Annual premiums + Deductible + (Coinsurance)(X &#8211; Deductible) &#8211; Employer HSA contributions<\/strong><\/p>\n\n\n\n<p>If you expect that your healthcare costs will be <em>less<\/em> than your deductible, use this formula instead:<\/p>\n\n\n\n<p class=\"has-text-align-center\"><strong>Net costs = Annual premiums + X &#8211; Employer HSA contribution<\/strong><\/p>\n\n\n\n<p>When you use these formulas, keep in mind that your plan will cap your out-of-pocket spending (that’s the “Deductible + (Coinsurance)(X &#8211; Deductible)” part of the equation) at a specific number.&nbsp;<\/p>\n\n\n\n<p>We know it’s easier to put this into practice with an example, so we’ll apply this framework to two Cigna plans available to Wealthfront employees a few years ago to see how they compare.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Example plan comparison:<\/strong> Cigna’s PPO 250 vs. Cigna’s HSA 1400<\/h3>\n\n\n\n<p>The table below shows the details of two Cigna plans that were available to Wealthfront employees a few years ago: the PPO 250 and HSA 1400. While Wealthfront covers 100% of premiums for individual employees, note that it’s <a href=\"https:\/\/www.peoplekeep.com\/blog\/what-percent-of-health-insurance-is-paid-by-employers\">more typical<\/a> for an employer to cover about 80% of individual premiums and about 70% of family premiums. The HSA contributions reflected below are what Wealthfront offers employees, but average employer HSA contributions are lower at <a href=\"https:\/\/www.ebri.org\/content\/new--long-term-analysis-of-health-savings-account-usage-finds-contributions-below-maximum-levels--most-accountholders-taking-distributions-and-few-investing\">about $750<\/a>. <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1210\" height=\"386\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.08.32-AM.png\" alt=\"\" class=\"wp-image-14799\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.08.32-AM.png 1210w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.08.32-AM-640x204.png 640w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.08.32-AM-768x245.png 768w\" sizes=\"auto, (max-width: 1210px) 100vw, 1210px\" \/><\/figure>\n\n\n\n<p>For some kinds of care (like specialist and primary care visits) you would actually pay a $15 copay per visit after hitting your deductible with the PPO rather than 10% coinsurance. For other kinds of care, like an emergency room visit, you’d pay a $100 copay with the PPO. However, these flat fees make the plans challenging to model accurately – so instead, for simplicity, we assumed you’d pay 10% coinsurance for all healthcare after meeting your deductible.<\/p>\n\n\n\n<p>Using the formula above, here is how you’d fare at a few different levels of spending with these two plans. We’ll assume all money spent on healthcare is in-network, as out-of-network healthcare costs vary and are much higher. We’ll also assume the money you spent on healthcare is not for preventative care (which your insurance will typically pay for even before you hit your deductible).&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1276\" height=\"1042\" src=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.09.41-AM.png\" alt=\"\" class=\"wp-image-14800\" srcset=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.09.41-AM.png 1276w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.09.41-AM-612x500.png 612w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.09.41-AM-649x530.png 649w, https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2021\/11\/Screen-Shot-2021-11-05-at-11.09.41-AM-768x627.png 768w\" sizes=\"auto, (max-width: 1276px) 100vw, 1276px\" \/><\/figure>\n\n\n\n<p>You would be indifferent between the two plans in this example if you were a single employee with $3,050 in medical expenses that year – at that level of spending, the two plans would cost you the same amount out-of-pocket. If you spent less than $3,050, you would be better off with the HDHP. If you spent more than $3,050, you would be better off with the PPO.<\/p>\n\n\n\n<p>However, there’s no situation in which a Wealthfront employee with a spouse or family covered by these specific plans would have come out ahead with the PPO. That’s because the difference between the premiums and employer HSA contributions is larger than the difference between the plans’ respective out-of-pocket maxes. If you are comparing two plans where this is the case, you can confidently choose the HDHP.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Choosing the plan that’s right for you<\/h2>\n\n\n\n<p>The results above are specific to the two Cigna plans we examined — it’s very important that you use the formula to evaluate the actual plans you’re choosing between, as your results could be very different. We included the details of these plans to help illustrate a framework for choosing your plan, not to give broad advice about HDHPs and PPOs. The HSA 1400 offered to Wealthfront employees had what was, at the time, the lowest possible deductible for an HDHP, which is part of why it looks so much more attractive than the PPO 250 in most cases. (These numbers have changed. In 2025, the lowest possible deductible for an HDHP is $1,650 for an individual and $3,300 for a family.) HDHP deductibles can be much higher.&nbsp; That’s why it’s crucial that you evaluate your own plans instead of treating these as representative. If your plans have different premiums, deductibles, employer HSA contributions, coinsurance, or out-of-pocket maxes, then you could get a very different result.<span id=\"docs-internal-guid-36ee65d4-7fff-3824-f676-3c26904b8cf9\"><\/span><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How should you estimate your medical expenses?<\/h2>\n\n\n\n<p>Estimating your medical expenses for the upcoming year can be challenging, but it’s an important part of choosing your health insurance. Ask your employer if they have a calculator to help you understand what your healthcare costs might be. If there is no calculator available, here’s how to estimate costs yourself.<\/p>\n\n\n\n<p>Start by multiplying any recurring monthly healthcare expenditures, like prescription refills, by 12 to understand the annual cost. You should also think about the long tail of medical expenses you might incur in a year. If you see your primary care doctor twice per year, you should factor in what you’d pay for those visits. You should also think about how many specialist visits you’re likely to need that year and estimate the cost of those. If you still have your medical bills from previous years, you can use them to help you ballpark the costs.<\/p>\n\n\n\n<p>Finally, think about any larger medical costs you might face. Do you plan to start a family? Do you have a major surgery on the calendar? Are you experiencing a chronic health issue? Factor that in, too. The higher you expect your medical costs will be, the more likely you are to be better off with a PPO.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Pros and cons of HSAs<\/h2>\n\n\n\n<p>Many people are tempted to choose an HDHP solely because of the tax-advantaged nature of HSAs, but this isn’t a great reason on its own. HSAs have significant pros and cons you should be sure to factor in, along with the other details of your particular plan options.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Benefits of HSAs<\/strong><\/h3>\n\n\n\n<p>HSAs have significant tax benefits now and in the future. In most states, you can invest your HSA funds and let them grow tax-free, and then you can withdraw them for qualified medical expenses without paying taxes. In other words, it’s like combining the best of a <a href=\"https:\/\/www.investopedia.com\/terms\/t\/traditionalira.asp\">traditional IRA<\/a> and a <a href=\"https:\/\/www.investopedia.com\/terms\/r\/rothira.asp\">Roth IRA<\/a>.&nbsp;<\/p>\n\n\n\n<p>HSAs offer you an opportunity to build up even more savings for qualified medical expenses over time, because you don’t have to treat employer HSA contributions like cash and spend them the year you receive them. You can also roll any leftover money over to future years and invest it so it compounds tax-free, allowing you to offset an even larger amount of medical expenses in the future.&nbsp;<\/p>\n\n\n\n<p>HSA withdrawals become more flexible after you turn 65. At that point, you can make withdrawals for purposes other than qualified medical expenses and not pay a penalty. However, it’s worth noting that you might not be eligible to make HSA <em>contributions<\/em> after you turn 65. <a href=\"https:\/\/www.morningstar.com\/financial-advisors\/how-preserve-your-hsa-eligibility-beyond-age-65\">Here’s a helpful resource on the rules<\/a>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>HSA drawbacks<\/strong><\/h3>\n\n\n\n<p>However, you shouldn’t overlook HSAs’ limitations just because they’re tax-advantaged. A <a href=\"https:\/\/www.morningstar.com\/lp\/hsa-landscape\">recent report on the HSA landscape by Morningstar<\/a> found that HSA fees can be high (even though Morningstar found they were decreasing overall), with custodial fees as high as 0.50%. Some HSA providers also charge fees for monthly account maintenance. These fees have the potential to eat away at your contributions and returns in a big way. Unfortunately, Wealthfront doesn’t currently have an HSA offering for clients.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The bottom line<\/h2>\n\n\n\n<p>HDHPs can be a good form of insurance for the young and healthy — especially if your employer offers you HSA contributions. But for anyone with significant medical expenses, an upcoming surgery, or a serious health condition, a PPO could be a better fit because of the lower deductible. However, if your employer offers you an HDHP with a low deductible and a generous HSA contribution, that HDHP could be a better deal than a PPO even if you expect your healthcare spending for the year will be high. We encourage you to make the decision between an HDHP and PPO based on the formula we provided, using your anticipated medical expenses, the premiums you’ll pay, your employer’s HSA contributions, coinsurance, and the deductible and out-of-pocket spending cap for the plans you’re evaluating. It might feel like a hassle, but you’ll sleep better at night knowing you selected the health insurance plan that’s right for you.&nbsp;<br><\/p>\n\n\n\n\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>HDHP, PPO, HSA … the acronyms and the options can seem endless when you’re evaluating health insurance plans. Choosing the right plan is an important financial decision, and it’s wise to weigh the details carefully. In this post, we’ll dig into the tradeoffs associated with choosing a high-deductible health plan (HDHP) over a traditional preferred [&hellip;]<\/p>\n","protected":false},"author":10000,"featured_media":7253,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[1278],"tags":[1822,1823,1824,1825,1826,1777,1827],"coauthors":[2507],"class_list":["post-4478","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-planning","tag-hdhp","tag-health-insurance","tag-health-savings-account","tag-high-deductible-health-plan","tag-hsa","tag-insurance","tag-ppo"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>HDHP vs. PPO: How To Choose Between Health Insurance Plans<\/title>\n<meta name=\"description\" content=\"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"HDHP vs. PPO: How To Choose Between Health Insurance Plans\" \/>\n<meta property=\"og:description\" content=\"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/\" \/>\n<meta property=\"og:site_name\" content=\"Wealthfront Blog\" \/>\n<meta property=\"article:published_time\" content=\"2024-10-24T21:33:40+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-24T22:30:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1472\" \/>\n\t<meta property=\"og:image:height\" content=\"530\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Kevin Teague, CFP\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:site\" content=\"@Wealthfront\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Kevin Teague, CFP\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/\",\"url\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/\",\"name\":\"HDHP vs. PPO: How To Choose Between Health Insurance Plans\",\"isPartOf\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg\",\"datePublished\":\"2024-10-24T21:33:40+00:00\",\"dateModified\":\"2024-10-24T22:30:58+00:00\",\"author\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\"},\"description\":\"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage\",\"url\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg\",\"contentUrl\":\"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg\",\"width\":1472,\"height\":530},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.wealthfront.com/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"HDHP vs. PPO: What You Need to Know\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#website\",\"url\":\"https:\/\/www.wealthfront.com/blog\/\",\"name\":\"Wealthfront Blog\",\"description\":\"Personal Finance &amp; Investing Insights\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563\",\"name\":\"Elizabeth Rowe\",\"url\":\"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"HDHP vs. PPO: How To Choose Between Health Insurance Plans","description":"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/","og_locale":"en_US","og_type":"article","og_title":"HDHP vs. PPO: How To Choose Between Health Insurance Plans","og_description":"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.","og_url":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/","og_site_name":"Wealthfront Blog","article_published_time":"2024-10-24T21:33:40+00:00","article_modified_time":"2024-10-24T22:30:58+00:00","og_image":[{"width":1472,"height":530,"url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg","type":"image\/jpeg"}],"author":"Kevin Teague, CFP","twitter_card":"summary_large_image","twitter_creator":"@Wealthfront","twitter_site":"@Wealthfront","twitter_misc":{"Written by":"Kevin Teague, CFP","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/","url":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/","name":"HDHP vs. PPO: How To Choose Between Health Insurance Plans","isPartOf":{"@id":"https:\/\/www.wealthfront.com/blog\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage"},"image":{"@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage"},"thumbnailUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg","datePublished":"2024-10-24T21:33:40+00:00","dateModified":"2024-10-24T22:30:58+00:00","author":{"@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563"},"description":"Are you considering a high deductible health plan? Here’s a guide to the differences between a HDHP and a PPO.","breadcrumb":{"@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#primaryimage","url":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg","contentUrl":"https:\/\/www.wealthfront.com/blog\/wp-content\/uploads\/2017\/01\/family04.jpg","width":1472,"height":530},{"@type":"BreadcrumbList","@id":"https:\/\/www.wealthfront.com/blog\/high-deductible-health-plan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.wealthfront.com/blog\/"},{"@type":"ListItem","position":2,"name":"HDHP vs. PPO: What You Need to Know"}]},{"@type":"WebSite","@id":"https:\/\/www.wealthfront.com/blog\/#website","url":"https:\/\/www.wealthfront.com/blog\/","name":"Wealthfront Blog","description":"Personal Finance &amp; Investing Insights","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.wealthfront.com/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.wealthfront.com/blog\/#\/schema\/person\/dab26849baacffef502035f907045563","name":"Elizabeth Rowe","url":"https:\/\/www.wealthfront.com/blog\/author\/elizabethrowe\/"}]}},"_links":{"self":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/4478","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/users\/10000"}],"replies":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/comments?post=4478"}],"version-history":[{"count":10,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/4478\/revisions"}],"predecessor-version":[{"id":17440,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/posts\/4478\/revisions\/17440"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media\/7253"}],"wp:attachment":[{"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/media?parent=4478"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/categories?post=4478"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/tags?post=4478"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.wealthfront.com/blog\/wp-json\/wp\/v2\/coauthors?post=4478"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}